{
  "langCode": "de",
  "site.title": "Shawn Gordon Becker",
  "nav.about": "Über mich",
  "nav.services": "Leistungen",
  "nav.projects": "Projekte",
  "nav.arts": "Kunst",
  "nav.contact": "Kontakt",

  "home.header.title": "Willkommen in meiner Ecke des Internets",
  "home.header.subtitle": "Ein digitaler Raum, der einen menschlichen widerspiegelt.",
  "home.intro.p1": "Diese Seite ist mehr als ein Portfolio. Sie ist ein lebendiges Archiv dessen, was ich im Laufe der Zeit geschaffen, erforscht und was mir wichtig war – sowohl beruflich als auch privat. Du findest hier Webprojekte, kreative Arbeiten, Kollaborationen und stille Reflexionen.",
  "home.intro.p2": "Ich glaube, die digitale Welt sollte mehr sein als nur schnell und effizient – sie sollte sich bedeutsam, bewusst und menschlich anfühlen. Das ist der rote Faden, der sich durch alles zieht, was ich tue: vom Schreiben von sauberem, durchdachtem Code über die Gestaltung von Benutzeroberflächen, die sich ruhig anfühlen, bis hin zum Aufbau von Gemeinschaften und kreativen Räumen, die auf Vertrauen basieren.",
  "home.intro.p3": "Ob du als potenzieller Kollaborateur, neugieriger Besucher oder jemand, der ähnliche Werte teilt, hier bist – ich freue mich, dass du hierher gefunden hast. Nimm dir Zeit. Schlendere. Entdecke. Melde dich.",

  "about.hero.title": "Über mich",
  "about.hero.subtitle": "Nicht nur, was ich tue – sondern warum ich es tue.",
  "about.intro.greeting": "Hallo, ich bin Shawn.",
  "about.intro.p1": "Ich bin Full-Stack-Entwickler, Produktdenker und interdisziplinär Kreativer. Mein Weg war nie streng linear – er wurde von Neugier, Zusammenarbeit und einem starken inneren Kompass geprägt.",
  "about.intro.p2": "Was meine Arbeit eint, ist der Wunsch, mit Sorgfalt zu bauen: Dinge zu schaffen, die nützlich und schön sind und auf solidem Grund stehen. Ich habe in Startups, gemeinnützigen Organisationen, kulturellen Initiativen und an meinen eigenen unabhängigen Projekten gearbeitet. Ich habe Teams geleitet, Produkte von Grund auf neu entwickelt, bis in die Nacht hinein programmiert und Gespräche ermöglicht, die wichtig sind.",
  "about.intro.p3": "Aber jenseits von Rollen und Fähigkeiten interessiere ich mich für die Zwischenräume – zwischen Technologie und Ethik, zwischen Design und Gefühl, zwischen Produktivität und Präsenz.",
  "about.keyThreads.title": "Einige Schlüsselthemen, die mich ausmachen:",
  "about.keyThreads.item1.title": "Internationaler & interdisziplinärer Hintergrund:",
  "about.keyThreads.item1.text": "Ich habe Produktmanagement, Marketing & Informatik studiert – in Irland, Berlin und darüber hinaus.",
  "about.keyThreads.item2.title": "Gemeinschaft & Verbindung:",
  "about.keyThreads.item2.text": "Ich habe Gemeinschaften mitbegründet, Festivals veranstaltet und Erlebnisse gestaltet, die auf Verbindung basieren.",
  "about.keyThreads.item3.title": "Wertebasierter Ansatz:",
  "about.keyThreads.item3.text": "Mir liegen Nachhaltigkeit, Neurodiversität und die Schaffung von Systemen, die Komplexität respektieren, am Herzen.",
  "about.keyThreads.item4.title": "Philosophie:",
  "about.keyThreads.item4.text": "Ich glaube an kleine, gute Dinge, die gut gemacht sind – mit Klarheit, Herz und Zweck.",
  "about.cta.p1": "Diese Seite ist eine Möglichkeit, all diese Teile miteinander zu verweben.",
  "about.cta.p2": "Ich hoffe, sie gibt dir einen Eindruck davon, wer ich bin – und von den Dingen, die ich gerne mit anderen bauen würde.",
  "about.cta.connectLink": "Lass uns verbinden"
}
