{
  "langCode": "de",
  "site.title": "Shawn Gordon Becker",
  "nav.about": "Über mich",
  "nav.experience": "Erfahrung",
  "nav.projects": "Projekte",
  "nav.arts": "Kunst",
  "nav.contact": "Kontakt",

  "common.downloadCV": "Lebenslauf herunterladen (PDF)",
  "common.githubProfile": "GitHub Profil",
  "common.linkedinProfile": "LinkedIn Profil",

  "home.hero.nameVisual": "Shawn Gordon Becker",
  "home.hero.taglineVisual": "BEDEUTUNG",
  "home.hero.taglineVisual2": "FORM",
  "home.hero.taglineVisual3": "CODE",
  "home.hero.subIntroText": "Full-Stack-Entwickler mit Produktdenken. Ich entwickle skalierbare Webanwendungen mit technischer Sorgfalt und Blick für die Nutzer.",
  "home.intro.p1": "Diese Seite ist mehr als ein Portfolio. Sie zeigt, wo ich war und wo ich hingehe.",
  "home.intro.p2": "Hier findest du ausgewählte Projekte, Gedanken und Experimente an der Schnittstelle von Kunst und Technologie.",
  "home.cta.projects": "Projekte ansehen",
  "home.cta.experience": "Erfahrung ansehen",
  "home.cta.about": "Mehr über mich",
  "home.cta.downloadCV": "Lebenslauf herunterladen (PDF)",

  "about.title": "Über Mich",
  "about.pageSubtitle": "Ein Entwickler, dem Klarheit und Tiefe wichtig sind.",
  "about.greeting.title": "Hi, ich bin Shawn.",
  "about.greeting.p1": "Ich bin Fullstack-Webentwickler und Produktdenker. Ich verbinde technische Präzision mit Gespür für Design, analytisches Denken mit Empathie. Ich entwickle digitale Erlebnisse mit Integrität: klar, zielgerichtet, fundiert.",
  "about.greeting.p2": "Mich interessieren einfache, durchdachte und nachhaltige Lösungen. Lieber leise und echt als laut und glatt.",
  "about.greeting.p3": "Ich arbeite ruhig und fokussiert. Ich erkenne Muster, verstehe Systeme und versuche, Dinge zu entwickeln, die wirklich etwas verbessern.",

  "about.path.title": "Mein Weg",
  "about.path.p1": "Mein Weg war nicht geradlinig. Er begann irgendwo zwischen Musik und Code, Filmsets und Neugier. Studien in Marketing und Informatik legten das Fundament. Verbunden hat sich alles später an der CODE University: Struktur, Empathie, Sinn.",
  "about.path.p2": "Ich war in verschiedenen Rollen unterwegs: als Entwickler, Produktdenker, Mitgestalter in digitalen und kulturellen Kontexten. Ich arbeitete mit Startups wie YPTOKEY und Data4Life, gründete 2016 U/skillity (eine Plattform für geteiltes Wissen, seit 2021 pausiert) und die Kultstätte Keller, ein Raum für Kunst, Klang und Gemeinschaft. Zwischendurch war ich immer wieder bei Filmproduktionen, meist als Assistent hinter den Kulissen. Diese Erfahrungen haben geprägt, wie ich Zusammenarbeit, Timing und Präsenz verstehe.",

  "about.drivesMe.title": "Was mich antreibt",
  "about.drivesMe.item1.title": "Klarheit & Stimmigkeit",
  "about.drivesMe.item1.text": "Ich entwerfe Systeme und Interaktionen, die ruhig, nachvollziehbar und logisch sind. Unstimmigkeiten fallen mir früh auf, und ich suche dann nach Klarheit.",
  "about.drivesMe.item2.title": "Mensch & Werte",
  "about.drivesMe.item2.text": "Technologie sollte Menschen dienen, nicht ablenken. Ich entwickle mit Respekt für Zeit, Aufmerksamkeit und Vertrauen.",
  "about.drivesMe.item3.title": "Lernen & Machen",
  "about.drivesMe.item3.text": "Neugier treibt mich an. Ich lerne durchs Machen und hinterfrage das Gewohnte.",
  "about.drivesMe.item4.title": "Ästhetik & Handwerk",
  "about.drivesMe.item4.text": "Form ist mir genauso wichtig wie Funktion. Durchdachte Details und feine Entscheidungen machen den Unterschied. Schönheit zeigt Sorgfalt.",

  "about.skillset.title": "Womit ich arbeite",
  "about.skillset.devFullstack.title": "Fullstack-Webentwicklung",
  "about.skillset.devFullstack.skills": "JavaScript/TypeScript (React, Node.js), Go, HTML5, CSS3, API-Entwicklung, Datenbanken (MySQL, MongoDB), CMS (WordPress, Headless CMS)",
  "about.skillset.productStrategy.title": "Produktmanagement & Strategie",
  "about.skillset.productStrategy.skills": "Produktstrategie, Agile Methoden (Scrum, Kanban), Nutzerforschung & Testing (konzeptionell), UX-Konzeption & User Journey Mapping, Anforderungsmanagement, Feature-Priorisierung, MVP-Planung, Technisches Projektmanagement, Teammoderation",
  "about.skillset.ethicalConsulting.title": "Ethische & nachhaltige Technologie",
  "about.skillset.ethicalConsulting.skills": "Bewusste Technologieentscheidungen, Privacy-by-Design, Barrierefreiheit (WCAG), Green-IT-Ansätze, Wartungsstrategien",

  "about.outsideScreen.title": "Abseits vom Bildschirm",
  "about.outsideScreen.p1": "Abseits der Arbeit beschäftige ich mich mit Musik (hörend und produzierend), fermentiere Wasserkefir, fahre lange Strecken mit dem Rad oder bin draußen in der Natur. Neuerdings entdecke ich auch die Fotografie, langsam und intuitiv.",
  "about.outsideScreen.p2": "Ich lebe in Berlin und bin offen für sinnvolle, ortsunabhängige Zusammenarbeit weltweit.",

  "about.lookingFor.title": "Wonach ich suche",
  "about.lookingFor.p1": "Ich suche Arbeit bei produktorientierten Unternehmen, bei denen technische Exzellenz auf sinnvolle Wirkung trifft. Ich arbeite am besten in Umgebungen, die Folgendes schätzen:",
  "about.lookingFor.item1": "Saubere Architektur und wartbare Codebasen",
  "about.lookingFor.item2": "Funktionsübergreifende Zusammenarbeit zwischen Engineering, Produkt und Design",
  "about.lookingFor.item3": "Kontinuierliches Lernen und Wissensaustausch",
  "about.lookingFor.item4": "Produkte entwickeln, die das Leben von Menschen wirklich verbessern",
  "about.lookingFor.p2": "Ideale Teamgröße: 10-50 Personen. Ideale Rolle: Full-Stack Entwickler oder Backend-fokussierte Position mit Raum für Produktdenken.",
  "about.lookingFor.p3": "Standort: Berlin-basiert mit Offenheit für hybride/remote Setups.",
  "about.lookingFor.availability": "Verfügbarkeit: Offen für Gespräche über Timing",
  "about.lookingFor.ctaDownload": "Lebenslauf herunterladen (PDF)",

  "about.connect.title": "Lass uns in Kontakt kommen",
  "about.connect.p1": "Wenn dich etwas davon anspricht, ob du eine Projektidee hast, Gedanken austauschen oder gemeinsam etwas bewegen willst, schreib mir gerne:",
  "about.connect.ctaText": "Zur Kontaktseite",
  "about.connect.githubLinkText": "Mein GitHub-Profil",

  "arts.title": "Kunst",
  "arts.subtitle": "Jenseits des Codes: Kreative Arbeit & Fotografie. Erkundung ohne Ergebnis, nur Präsenz, Übung und Spiel.",
  "arts.intro.title": "Kreativer Hintergrund",
  "arts.intro.p1": "Bevor ich Code schrieb, machte ich Musik. Bevor ich Oberflächen gestaltete, folgte ich dem Licht durch eine Linse. Kunst ist keine separate Kategorie. Sie ist eine andere Art, der Welt zuzuhören.",
  "arts.intro.p2": "Dieser Bereich ist ein Fenster in die kreative Seite meines Lebens:",
  "arts.photography.title": "Fotografie",
  "arts.photography.text": "Fragmente von Licht, Architektur, Stimmung und Bewegung",
  "arts.sound.title": "Klang & Musik",
  "arts.sound.text": "Analoge und digitale Erkundungen, Ambient-Kompositionen, klangliches Tagebuchschreiben",
  "arts.sketches.title": "Skizzen & Studien",
  "arts.sketches.text": "Visuelle Experimente, Layout-Erkundungen, eingefangene Atmosphären",
  "arts.outro.p1": "Ich veröffentliche nicht alles, was ich mache, aber ich teile, was sich ehrlich anfühlt. Diese Arbeiten sind nicht immer fertig, aber sie sind immer wahrhaftig.",
  "arts.outro.p2": "Kreativität bedeutet nicht, Talent zur Schau zu stellen. Es geht darum, präsent zu sein, aufmerksam zu sein, die Intuition den Weg weisen zu lassen.",
  "arts.gallery.imageAlt": "Kunstbild",
  "arts.gallery.viewImageText": "Bild ansehen",

  "projects.title": "Meine Projekte",
  "projects.pageSubtitle": "Ausgewählte Arbeiten, Spielwiesen und Kollaborationen",
  "projects.introduction.title": "Einleitung",
  "projects.introduction.p1": "Diese Seite zeigt eine Auswahl digitaler und kultureller Projekte, an denen ich über die Jahre beteiligt war, von persönlichen Portfolio-Websites bis hin zu kollaborativen Festivalräumen und Filmarbeiten.",
  "projects.introduction.p2": "Ich versuche, meine digitale Arbeit schlank, zugänglich und bedeutsam zu halten. Diese Webseite ist sowohl Experimentierplattform als auch Momentaufnahme meines sich entwickelnden Handwerks.",
  "projects.currentProject.title": "Aktuelles Projekt: Überarbeitung dieser Webseite",
  "projects.currentProject.description": "Dieses Portfolio ist ein laufendes Projekt, um mein Verständnis von serverseitigem Rendering mit Go und Templating zu vertiefen. Es ist Spielplatz für Experimente und eine saubere, schnelle, mehrsprachige Website.",
  "projects.currentProject.motivation.label": "Motivation",
  "projects.currentProject.motivation.text": "Go-Templating lernen, meine Online-Präsenz mit voller Kontrolle und minimalem Tech-Stack neu aufbauen",
  "projects.currentProject.stack.label": "Tech-Stack",
  "projects.currentProject.stack.item1": "Go (Golang) + templ SSR-Templating",
  "projects.currentProject.stack.item2": "Gehostet auf Render",
  "projects.currentProject.stack.item3": "E-Mail-Service-Integration mit Resend",
  "projects.currentProject.stack.item4": "Sprachfallback und Routing (i18n)",
  "projects.currentProject.stack.item5": "Kein Framework – reines HTML, CSS und Logik",
  "projects.currentProject.linkGithubText": "GitHub Repo",

  "projects.websitesBuilt.title": "Erstellte Webseiten",
  "projects.websitesBuilt.jessebecker.name": "jessebecker.de",
  "projects.websitesBuilt.jessebecker.description": "Minimalistisches Künstlerportfolio in reinem HTML, CSS & JavaScript. Gebaut für Geschwindigkeit, Klarheit und langfristige Wartbarkeit.",
  "projects.websitesBuilt.arinashanzev.name": "arinashanzev.com (in Arbeit)",
  "projects.websitesBuilt.arinashanzev.description": "Ein WordPress-Portfolio für eine Praktizierende im Bereich Energiearbeit und Therapie, mit individuellem Theme und einem durchdachten Layout, das die Essenz ihrer Arbeit vermittelt.",
  "projects.websitesBuilt.berndwolf.name": "berndwolf.net (freiberufliche Unterstützung)",
  "projects.websitesBuilt.berndwolf.description": "Maßgeschneiderte WordPress-Anpassungen und funktionale Erweiterungen für das Künstlerportfolio von Bernd Wolf, mit Fokus auf nahtlose Integration und den Erhalt der Theme-Integrität.",
  "projects.websitesBuilt.evolveFestivalWebsite.name": "evolve-festival.com",
  "projects.websitesBuilt.evolveFestivalWebsite.description": "Neugestaltung der früheren Wix-basierten Festival-Webseite (Hinweis: Diese Version ist nicht mehr online), um Benutzerfreundlichkeit und Klarheit zu verbessern, eine klare Informationshierarchie zu schaffen und ein eingebettetes Ticketsystem zu integrieren.",
  "projects.websitesBuilt.oldPortfolio.name": "Alte Portfolio-Webseite (2022)",
  "projects.websitesBuilt.oldPortfolio.description": "Eine SPA Webseite in React und TailwindCSS. Diente als meine anfängliche Webpräsenz.",
  "projects.websitesBuilt.uskillity.name": "U/skillity (Prototyp)",
  "projects.websitesBuilt.uskillity.description": "Konzept einer Bildungsplattform – Mitbegründer und Hauptentwickler des MVP mit Benutzerverwaltung und Content-Publishing.",
  "projects.websitesBuilt.uskillity.linkInstagramText": "Uskillity auf Instagram",
  "projects.websitesBuilt.uskillity.linkFrontendRepoText": "Frontend Repo (GitHub)",
  "projects.websitesBuilt.uskillity.linkBackendRepoText": "Backend Repo (GitHub)",

  "projects.cultural.title": "Kulturelle & Kreative Projekte",
  "projects.cultural.kultschaette.name": "Kultstätte Keller (2011–2016)",
  "projects.cultural.kultschaette.p1": "Mitbegründer der Kultstätte Keller, eines lebendigen, hybriden Kulturraums in Berlin, der ein Yogastudio, Aufnahmemöglichkeiten, einen Club und einen Workshop-Ort beherbergte.",
  "projects.cultural.kultschaette.p2": "Verantwortlich für kreative Leitung, Eventmanagement, technische Infrastruktur und Kommunikation für diesen Community-Treffpunkt.",
  "projects.cultural.evolveFestivalSupport.name": "Evolve Festival (2024–2025)",
  "projects.cultural.evolveFestivalSupport.p1": "Organisatorische Unterstützung und Webseite-Relaunch für die Ausgabe 2023, beteiligt an Kommunikation, Struktur und UX-Design.",
  "projects.cultural.vegetarischDeluxe.name": "Vegetarisch Deluxe (2006–2009)",
  "projects.cultural.vegetarischDeluxe.p1": "Bassist und Mitschöpfer dieser DIY-Punkband. Verantwortlich für Webseite, Booking und visuelle Inhalte.",

  "projects.film.title": "Filmprojekte",
  "projects.film.description": "Mitglied der Filmproduktionscrew bei verschiedenen Kurz- und Langfilmprojekten, hauptsächlich in den Bereichen Licht und Kamera.",
  "projects.film.linkCrewUnitedText": "Shawn Gordon Becker bei Crew United",

  "experience.title": "Erfahrung",
  "experience.pageSubtitle": "Von Klang zu Systemen — Ein nicht-linearer Weg zur Softwareentwicklung",

  "experience.chapter1.title": "Klang, Raum und Systeme",
  "experience.chapter1.subtitle": "2006 - 2016",
  "experience.chapter1.p1": "Ich habe das Bauen von Systemen nicht in einem Informatik-Hörsaal gelernt. Es begann mit 21 Jahren, hinter einem Mischpult am SAE Institute in Berlin, wo ich lernte, akustische Räume zu gestalten. Ich hatte als Jugendlicher Bass in einer Punkband gespielt (Musik war immer präsent), doch Virtuosität interessierte mich nicht. Was mich anzog, war das Engineering: wie Frequenzen interagieren, wie ein Mix Dimensionen schafft, wie man aus diskreten Elementen eine Atmosphäre baut.",
  "experience.chapter1.p2": "Die Audioproduktion lehrte mich eine Denkweise, für die ich damals noch keine Worte hatte. Man balanciert ständig Elemente aus, findet Klarheit in Komplexität, trifft technische Entscheidungen, die einem Gefühl dienen. Nach dem SAE verbrachte ich mehrere Jahre mit Erkundungen, verschiedenen Jobs, darunter Assistenztätigkeiten bei Filmproduktionen durch die Kontakte meines Vaters als Kameramann. Diese Filmdrehs lehrten mich Zusammenarbeit unter Druck, Handwerk und Präsenz, wenn die Arbeit es verlangt.",
  "experience.chapter1.p3": "2011 wurde ich über Freunde in Berlins Kulturszene in ein leerstehendes Gebäude in Neukölln einbezogen. Die Idee war, Raum für Kunst und Gemeinschaftsevents zu schaffen. Ich begann, Tonstudios im Keller zu bauen. Was wir stattdessen schufen, war Kultstätte Keller, das von gelegentlichen Partys zu einem Nachtclub wuchs, der sechs Nächte die Woche Entertainment bot. Ich habe die Studios nie fertiggestellt. Stattdessen wurde ich Mitinhaber und Betreiber, zuständig für Soundsysteme, technische Infrastruktur und Logistik für einen Ort, der seine eigene Dynamik gefunden hatte.",
  "experience.chapter1.p4": "Das Betreiben von Kultstätte lehrte mich Systeme in großem Maßstab: organisatorisch, technisch, menschlich. Aber es zeigte mir auch die Grenzen einer bestimmten Art von Erfolg. Ab 2015, nach Jahren im Nachtleben, begann ich den Tribut zu bemerken: wie Menschen in diesem Umfeld altern, der Konsum, der damit einhergeht, das Gefühl, dass etwas Wesentliches fehlte. Ich wollte Dinge bauen, die anders Bestand haben.",
  "experience.chapter1.p5": "Um diese Zeit machte ich ein dreimonatiges Praktikum in den Peppermint Park Studios in Hannover, wo ich unter Hans Martin Buff arbeitete, der später einen Grammy gewinnen würde. In diesen drei Monaten lernte ich mehr über Tontechnik als während meiner gesamten formalen Ausbildung, nicht weil das Curriculum besser war, sondern weil ich direkt von jemandem lernte, der zutiefst leidenschaftlich für sein Handwerk war. Diese Erfahrung pflanzte einen Samen: Leidenschaftliche Menschen lehren ihr Handwerk mühelos, und Lernen funktioniert am besten, wenn es peer-to-peer und praxisbasiert ist.",
  "experience.chapter1.p6": "Diese Einsicht wurde zu U/skillity, einer Plattformidee, die ich mit meiner Freundin mitgründete: ein Peer-to-Peer-Marktplatz für Mikroskills, wo jeder lehren konnte, was er wusste, und lernen konnte, was er brauchte. Denk an Airbnb, aber für Wissen. Das Problem war, dass ich kein wirkliches Verständnis von Business oder Technologie hatte, außer dem, was ich intuitiv aufgeschnappt hatte.",
  "experience.chapter1.p7": "Also absolvierte ich 2016 eine IHK-Zertifizierung in Betriebswirtschaft und entdeckte etwas Unerwartetes: Ich genoss strukturiertes Lernen. Ich hatte die Schule früh verlassen, gelangweilt und unterfordert, doch jetzt mit 30 und Jahren praktischer Erfahrung fühlte sich formale Bildung anders an. Ich wollte mehr. Aber ohne Abitur waren traditionelle Universitätswege verschlossen.",
  "experience.chapter1.p8": "Da fand ich das HEAR-Programm an der National University of Ireland Maynooth, ein Weg für reife Studierende, die später ins Hochschulwesen einsteigen. Ich absolvierte die Aufnahmeprüfungen, wurde akzeptiert und zog nach Irland.",

  "experience.chapter2.title": "Die Formalisierungsjahre",
  "experience.chapter2.subtitle": "2016 - 2022",
  "experience.chapter2.p1": "Irland war hart. Ich studierte Vollzeit Business und Marketing, fühlte mich aber zunehmend zu einem Informatik-Modul hingezogen, das ich hinzugefügt hatte – besonders Java-Programmierung, die anders klickte als die Business-Kurse. Die Arbeit war intensiv: fünf Tage Vorlesungen, dann abends und am Wochenende im Apple-Einzelhandel arbeiten, um alles zu finanzieren. Aber ich lernte, und U/skillity lief remote weiter, während meine Freundin und ich an Prototypen arbeiteten.",
  "experience.chapter2.p2": "Nach anderthalb Jahren entdeckte ich etwas Interessantes: Weil ich an einer EU-Universität akzeptiert worden war, konnte ich überall in Europa wechseln. Ich hatte von der CODE University in Berlin gehört – einer neuen Art von Institution, die sich auf interdisziplinäre Produktentwicklung und angewandtes Lernen konzentrierte. Ich bewarb mich, wurde angenommen und zog 2018 zurück nach Hause, um Produktmanagement zu studieren.",
  "experience.chapter2.p3": "An der CODE begannen die Dinge zu konvergieren. Das Programm betonte Synthese: wie Technologie, Design, Business und menschliche Bedürfnisse sich überschneiden. Struktur, Empathie und Zweck waren keine separaten Anliegen – sie formten einander. Aber ich musste auch arbeiten. Da fand ich YPTOKEY, ein Startup, das blockchain-basierte IoT-Zugangssysteme baute.",
  "experience.chapter2.p4": "Ich kam als Product Owner und Frontend Developer, fand mich aber schnell in einer unerwarteten Rolle: Übersetzer. Der CEO und der CTO sprachen verschiedene Sprachen – einer fokussiert auf Geschäftsstrategie, der andere auf technische Architektur – und ich konnte beide verstehen. Ich begann, React-Proof-of-Concepts für potenzielle Kunden zu bauen, erklärte Blockchain den Verkaufsteams und überbrückte die Lücke zwischen Vision und Umsetzung. Es war das erste Mal, dass ich etwas mit Code gebaut hatte, das für ein Geschäftsergebnis wichtig war, und ich war weitgehend Autodidakt, stützte mich auf die Java-Grundlagen aus Irland und Ressourcen von CODE.",
  "experience.chapter2.p5": "Als COVID 2020 kam, geriet YPTOKEY unter finanziellen Druck und ich verlor die Rolle. Ich nutzte die Zeit, um zu überdenken, was ich eigentlich tun wollte – und stellte fest, dass mir das Programmieren mehr fehlte als das Produktmanagement. Anfang 2021 nahm ich eine Rolle als Technical Project Manager bei Data4Life an, einem Digital-Health-Unternehmen. Das Team war freundlich, aber die Arbeit fühlte sich fehlausgerichtet an: den Versuch, eine Startup-Kultur in einer Konzernstruktur zu schaffen, mit Leuten zu arbeiten, die das fundamental nicht wollten. Es klärte etwas Wichtiges: Ich wollte bauen, nicht nur koordinieren.",
  "experience.chapter2.p6": "Mitte 2021 wechselte ich zu Freiheit.software als Frontend Developer. Ich liebte es sofort – remote arbeiten, beim Coden reisen, an echten Enterprise-Anwendungen mit React, Node.js und TypeScript arbeiten. Dann passierte etwas Unerwartetes: Das Team brauchte Full-Stack-Unterstützung, und ich wurde ins Backend gezogen. Ich entdeckte, dass mir das sogar noch mehr gefiel. Es gab etwas zutiefst Befriedigendes daran, Systeme Ende-zu-Ende zu designen, über Architektur, Datenfluss und das logische Zusammenspiel der Teile nachzudenken.",
  "experience.chapter2.p7": "Als Freiheit Ende 2022 einen Kunden verlor und mich entlassen musste, nutzte ich einen Kontakt zu einem ihrer ehemaligen Kunden, um als Freelancer zu starten. Nach Jahren in Anstellung dachte ich, Unabhängigkeit könnte das sein, was ich brauchte.",

  "experience.chapter3.title": "Die Suche nach Tiefe",
  "experience.chapter3.subtitle": "2023 - Heute",
  "experience.chapter3.p1": "Nach drei Jahren Freelance-Arbeit habe ich gelernt, was ich nicht will, genauso klar wie das, was ich will.",
  "experience.chapter3.p2": "Die Freiheit ist real – ich bestimme meinen Zeitplan, wähle meine Tools, arbeite von überall. Aber die Arbeit selbst war einschränkend: meist kleine Landing Pages, WordPress-Anpassungen, Design-Tweaks für Kunden, die eine Web-Präsenz brauchen, aber kein System. Mir wurde klar, dass mir Kundenakquise keinen Spaß macht, und ich vermisse die Struktur eines regelmäßigen Einkommens. Aber mehr noch vermisse ich tiefe logische Arbeit.",
  "experience.chapter3.p3": "Was ich damit meine: Backends bauen, Systeme architekturieren, komplexe Probleme lösen, die nachhaltiges Nachdenken und sorgfältiges Design erfordern. Die Art von Arbeit, bei der man nicht ein Template anpasst, sondern etwas mit innerer Logik und Kohärenz erschafft. Ich vermisse die Arbeit mit einem Team – Leute, von denen man lernen kann, mit denen man Code reviewed, Abwägungen und Ansätze diskutiert.",
  "experience.chapter3.p4": "U/skillity taucht gelegentlich wieder in meinen Gedanken auf. Jetzt, da ich die technischen Fähigkeiten habe, denke ich manchmal darüber nach, es richtig neu aufzubauen. Die Idee – dass leidenschaftliche Menschen am besten lehren und Lernen peer-getrieben sein sollte – ist nie wirklich verschwunden. Es ist Teil dessen, warum mir Mentoring und Wissensaustausch in Teams wichtig sind.",
  "experience.chapter3.p5": "2025, nach Monaten erfolgloser Bewerbungen, schrieb ich mich im Advanced Web Development Program bei Neue Fische ein – einem intensiven Bootcamp mit Fokus auf modernem TypeScript, Backend-Architektur, Testing-Strategien und Deployment-Workflows. Es war eine Möglichkeit, meine Fähigkeiten zu schärfen, mein Wissen zu aktualisieren und während der Suche aktuell zu bleiben.",
  "experience.chapter3.p6": "Was ich suche, ist jetzt klarer als je zuvor. Ich will in einem Team arbeiten – idealerweise 10-50 Personen – wo ich als Full-Stack- oder Backend-fokussierter Entwickler beitragen kann. Ich will an Produkten arbeiten, die wichtig sind, mit sauberer Architektur und funktionsübergreifender Zusammenarbeit zwischen Engineering, Design und Product. Ich will tief in Systeme, Datenbanken, APIs und Infrastruktur eintauchen – Dinge bauen, die kohärent, wartbar und in echten Nutzerbedürfnissen verwurzelt sind.",
  "experience.chapter3.p7": "Rückblickend ergibt der Weg Sinn. Tontechnik lehrte mich, Systeme aus Komponenten zu formen. Kultstätte lehrte mich, Komplexität zu managen und mich anzupassen, was entsteht. Filmarbeit lehrte mich Zusammenarbeit und Handwerk. U/skillity lehrte mich, dass mir wichtig ist, wie Menschen lernen. YPTOKEY lehrte mich, dass ich ein Übersetzer zwischen Disziplinen bin. Freiheit lehrte mich, dass ich Backend-Systemdenken liebe.",
  "experience.chapter3.p8": "Ich fange mit 40 keine Karriere an. Ich bringe zwanzig Jahre des Lernens mit, wie man Dinge baut, die funktionieren – ob klanglichkulturell oder digital – und fokussiere diese Synthese auf Softwaresysteme. Ich weiß jetzt, was mich antreibt: Klarheit, Tiefe und Arbeit, die etwas Echtes verbessert.",
  "experience.chapter3.p9": "Wenn du Produkte mit Sorgfalt baust und jemanden suchst, der über Disziplinen hinweg denkt, Systeme versteht und in die Tiefe gehen will – lass uns sprechen.",

  "experience.timeline.title": "Zeitstrahl",
  "experience.timeline.year2006": "2006",
  "experience.timeline.label2006": "Tontechnik (SAE)",
  "experience.timeline.year2011": "2011",
  "experience.timeline.label2011": "Kultstätte Keller (Mitgründer)",
  "experience.timeline.year2016": "2016",
  "experience.timeline.label2016": "U/skillity (Mitgründer) + IHK",
  "experience.timeline.year2017": "2017",
  "experience.timeline.label2017": "Irland (HEAR Mature Students)",
  "experience.timeline.year2018": "2018",
  "experience.timeline.label2018": "CODE University + YPTOKEY",
  "experience.timeline.year2021": "2021",
  "experience.timeline.label2021": "Data4Life → Freiheit",
  "experience.timeline.year2023": "2023",
  "experience.timeline.label2023": "Freelance-Praxis",
  "experience.timeline.year2025": "2025",
  "experience.timeline.label2025": "Neue Fische + Jobsuche",
  "experience.timeline.labelPresent": "Gegenwart",

  "experience.cta.downloadCV": "Vollständigen Lebenslauf herunterladen (PDF)",
  "experience.cta.viewProjects": "Projekt-Portfolio erkunden →",

  "contact.title": "Kontakt",
  "contact.subtitle": "Melde dich mit einer Idee, einer Frage oder einfach aus Neugier.",
  "contact.details.title": "Kontaktinformationen",
  "contact.intro.title": "Lass uns verbinden",
  "contact.intro.p1": "Ich bin immer offen für Gespräche, egal ob du zusammenarbeiten möchtest, Unterstützung für ein digitales Projekt benötigst oder dich einfach von etwas angezogen fühlst, das du hier gesehen hast.",
  "contact.intro.p2": "Du brauchst keinen ausgefeilten Pitch. Eine einfache Nachricht genügt. Ich schätze echte menschliche Verbindungen und gebe mein Bestes, auf jede Anfrage persönlich zu antworten.",
  "contact.intro.availability": "Offen für Festanstellungen (sozialversicherungspflichtig) in Berlin und interessante Remote-Möglichkeiten.",
  "contact.form.firstname.label": "Vorname:",
  "contact.form.lastname.label": "Nachname:",
  "contact.form.email.label": "E-Mail:",
  "contact.form.phone.label": "Telefon (optional):",
  "contact.form.service.label": "Leistung (optional):",
  "contact.form.service.option.select": "Bitte wählen...",
  "contact.form.service.option.development": "Entwicklung",
  "contact.form.service.option.consulting": "Beratung",
  "contact.form.service.option.productManagement": "Produktmanagement",
  "contact.form.service.option.other": "Andere",
  "contact.form.message.label": "Ihre Nachricht:",
  "contact.form.submitButton": "Nachricht senden",
  "contact.form.loadingIndicator": "Wird gesendet...",
  "contact.reachOutIf.title": "Du könntest dich melden, wenn:",
  "contact.reachOutIf.item1": "Du einen Full-Stack oder Backend-Entwickler in Berlin suchst",
  "contact.reachOutIf.item2": "Du an einem Web- oder Kreativprojekt mitarbeiten möchtest",
  "contact.reachOutIf.item3": "Du etwas Durchdachtes baust und einen Entwickler oder Strategen benötigst",
  "contact.reachOutIf.item4": "Du dich mit digitaler Ethik oder nachhaltigen Technologiepraktiken beschäftigst",
  "contact.reachOutIf.item5": "Du einfach etwas teilen möchtest: einen Gedanken, einen Link, eine Idee",
  "contact.outro.p1": "Mal sehen, wohin das Gespräch führt.",
  "contact.error.internal": "Ein interner Fehler ist aufgetreten. Bitte versuche es später erneut.",
  "contact.error.requiredFields": "Bitte fülle alle Pflichtfelder aus (Vorname, Nachname, E-Mail und Nachricht).",
  "contact.error.configIssue": "Ihre Nachricht konnte aufgrund eines Serverkonfigurationsproblems nicht gesendet werden. Bitte verwenden Sie die E-Mail-Adresse in der Fußzeile.",
  "contact.error.sendFail": "Ihre Nachricht konnte nicht gesendet werden. Bitte versuchen Sie es später erneut oder verwenden Sie die E-Mail-Adresse in der Fußzeile.",
  "contact.success.messageSent": "Ihre Nachricht wurde erfolgreich gesendet! Ich melde mich so schnell wie möglich bei Ihnen.",
  "contact.methodNotAllowed": "Methode nicht erlaubt",
  "arts.error.loadImages": "Bilder für den Kunstbereich konnten nicht geladen werden.",

  "home.pageTitle": "Shawn Becker – Fullstack Entwickler & Produktdenker",
  "home.pageMetaDescription": "Fullstack Entwickler aus Berlin. TypeScript, Go, React. Code, Design & Produktdenken. Sinnvolle Weblösungen entwickeln.",

  "about.pageTitle": "Shawn Becker – Über mich, Entwickler & Denker",
  "about.pageMetaDescription": "Fullstack Entwickler mit 7+ Jahren Erfahrung. Technische Präzision trifft Produktdenken. TypeScript, React, Go. Berlin.",

  "experience.pageTitle": "Shawn Becker – 7+ Jahre Fullstack Entwicklung",
  "experience.pageMetaDescription": "7+ Jahre Fullstack: React, TypeScript, Go. Produktmanagement & Tech-Leadership für Startups. Standort Berlin.",

  "projects.pageTitle": "Shawn Becker – Webprojekte & Kreative Arbeiten",
  "projects.pageMetaDescription": "Portfolio: Go SSR, React SPAs, WordPress. Digitale & kulturelle Projekte aus Berlin. Fullstack Entwicklung mit Sinn.",

  "arts.pageTitle": "Shawn Becker – Fotografie & Kreative Kunst",
  "arts.pageMetaDescription": "Kreative Erkundungen jenseits des Codes: Fotografie, Sounddesign, visuelle Experimente. Künstlerische Praxis in Berlin.",

  "contact.pageTitle": "Kontakt Shawn Becker – Entwickler in Berlin",
  "contact.pageMetaDescription": "Fullstack Entwickler in Berlin. Verfügbar für Festanstellungen & Projekte. Expertise: TypeScript, React, Go."
}
