{
  "langCode": "de",
  "site.title": "Shawn Gordon Becker",
  "nav.about": "Über mich",
  "nav.services": "Leistungen",
  "nav.projects": "Projekte",
  "nav.arts": "Kunst",
  "nav.contact": "Kontakt",

  "home.hero.nameVisual": "Shawn Gordon Becker",
  "home.hero.taglineVisual": "BEDEUTUNG",
  "home.hero.taglineVisual2": "FORM",
  "home.hero.taglineVisual3": "CODE",
  "home.hero.subIntroText": "Fullstack Webentwickler & Digitaler Produktdenker – ich gestalte und entwickle digitale Lösungen, die Sinn, Ästhetik und Technik miteinander verbinden.",
  "home.intro.p1": "Diese Seite ist mehr als ein Portfolio. Sie ist ein wachsender Spiegel meines Weges.",
  "home.intro.p2": "Hier findest du ausgewählte Projekte, Gedanken und Experimente an der Schnittstelle von Kunst und Technologie.",
  "home.cta.projects": "Projekte ansehen",
  "home.cta.services": "Leistungen entdecken",
  "home.cta.about": "Mehr über mich",

  "about.title": "Über Mich",
  "about.pageSubtitle": "Zwischen Code und Sinn: Ein Entwickler mit Klarheit und Tiefe.",
  "about.greeting.title": "Hi, ich bin Shawn.",
  "about.greeting.p1": "Ich bin Fullstack-Webentwickler und digitaler Produktdenker – ich verbinde technische Präzision mit Gespür für Design. Ich denke digitale Produkte immer auch aus der Sicht der Nutzer:innen. Ich gestalte digitale Erlebnisse, die von Integrität geprägt sind – klar, zielgerichtet und fundiert.",
  "about.greeting.p2": "Mich interessieren einfache, durchdachte und nachhaltige Lösungen. Lieber leise und echt als laut und glatt.",
  "about.greeting.p3": "Ich arbeite ruhig, mit klarem Blick und viel Fokus. Ich erkenne Muster, verstehe Systeme – und versuche, Dinge zu entwickeln, die wirklich etwas verändern.",

  "about.path.title": "Mein Weg",
  "about.path.p1": "Mein Weg war nicht linear. Er begann irgendwo zwischen Musik und Code, Filmsets und Neugier. Studien in Marketing und Informatik legten das Fundament – verbunden hat sich alles später in meinem Studium an der CODE University: Struktur, Empathie, Sinn.",
  "about.path.p2": "Ich war in verschiedenen Rollen unterwegs – als Entwickler, Produktdenker, Mitgestalter in digitalen und kulturellen Kontexten. Ich arbeitete mit Startups wie YPTOKEY und Data4Life, gründete 2016 U/skillity (eine Plattform für geteiltes Wissen, seit 2021 pausiert) und die Kultstätte Keller – ein Raum für Kunst, Klang und Gemeinschaft. Zwischendurch war ich immer wieder bei Filmproduktionen, meist als Assistent hinter den Kulissen. Diese Erfahrungen waren bodenständig, aber prägend – für mein Verständnis von Zusammenarbeit, Timing und Präsenz.",

  "about.drivesMe.title": "Was mich antreibt",
  "about.drivesMe.item1.title": "Klarheit & Stimmigkeit:",
  "about.drivesMe.item1.text": "Ich entwerfe Systeme und Interaktionen, die ruhig, nachvollziehbar und logisch sind. Unstimmigkeiten fallen mir früh auf – und ich suche nach Klarheit als Antwort.",
  "about.drivesMe.item2.title": "Mensch & Werte:",
  "about.drivesMe.item2.text": "Technologie sollte Menschen dienen – nicht sie ablenken. Ich entwickle mit Respekt für Zeit, Aufmerksamkeit und Vertrauen.",
  "about.drivesMe.item3.title": "Lernen & Machen:",
  "about.drivesMe.item3.text": "Neugier ist mein Antrieb. Ich glaube ans Lernen durchs Machen – und ans Hinterfragen des Gewohnten.",
  "about.drivesMe.item4.title": "Ästhetik & Handwerk:",
  "about.drivesMe.item4.text": "Form ist mir genauso wichtig wie Funktion. Durchdachte Details, feine Entscheidungen – sie machen den Unterschied. Schönheit zeigt für mich: Da hat sich jemand wirklich gekümmert.",

  "about.skillset.title": "Kernkompetenzen & Technologien",
  "about.skillset.devFullstack.title": "Fullstack Webentwicklung",
  "about.skillset.devFullstack.skills": "JavaScript/TypeScript (React, Node.js), Go, HTML5, CSS3, API-Entwicklung, Datenbanken (MySQL, MongoDB), CMS (WordPress, Headless CMS)",
  "about.skillset.productStrategy.title": "Digitales Produktmanagement & Strategie",
  "about.skillset.productStrategy.skills": "Produktstrategie, Agile Methoden (Scrum, Kanban), Nutzerforschung & Testing (konzeptionell), UX-Konzeption & User Journey Mapping, Anforderungsmanagement, Feature-Priorisierung, MVP-Planung, Technisches Projektmanagement, Teammoderation",
  "about.skillset.ethicalConsulting.title": "Beratung für ethische & nachhaltige Technologie",
  "about.skillset.ethicalConsulting.skills": "Bewusste Technologieentscheidungen, Privacy-by-Design, Barrierefreiheit (WCAG), Green-IT-Ansätze, Wartungsstrategien",

  "about.outsideScreen.title": "Abseits vom Bildschirm",
  "about.outsideScreen.p1": "Wenn ich nicht gerade baue oder konzipiere, beschäftige ich mich mit Musik (hörend und produzierend), fermentiere Wasserkefir, fahre lange Strecken mit dem Rad oder bin einfach draußen in der Natur. Neuerdings entdecke ich auch die Fotografie – langsam, aus dem Gefühl heraus.",
  "about.outsideScreen.p2": "Ich lebe in Berlin und bin offen für sinnvolle, ortsunabhängige Zusammenarbeit weltweit.",

  "about.connect.title": "Lass uns in Kontakt kommen",
  "about.connect.p1": "Wenn dich etwas davon anspricht – ob du eine Projektidee hast, Gedanken austauschen oder gemeinsam etwas bewegen willst – schreib mir gerne:",
  "about.connect.ctaText": "Zur Kontaktseite",
  "about.connect.githubLinkText": "Mein GitHub-Profil",

  "arts.title": "Kunst",
  "arts.subtitle": "Erkundung ohne Ergebnis – nur Präsenz, Übung und Spiel.",
  "arts.intro.p1": "Bevor ich Code schrieb, machte ich Musik. Bevor ich Oberflächen gestaltete, folgte ich dem Licht durch eine Linse. Kunst ist für mich keine separate Kategorie – sie ist eine andere Art, der Welt zuzuhören.",
  "arts.intro.p2": "Dieser Bereich ist ein Fenster in die kreative Seite meines Lebens:",
  "arts.photography.title": "Fotografie:",
  "arts.photography.text": "Fragmente von Licht, Architektur, Stimmung und Bewegung",
  "arts.sound.title": "Klang & Musik:",
  "arts.sound.text": "analoge und digitale Erkundungen, Ambient-Kompositionen, klangliches Tagebuchschreiben",
  "arts.sketches.title": "Skizzen & Studien:",
  "arts.sketches.text": "visuelle Experimente, Layout-Erkundungen, eingefangene Atmosphären",
  "arts.outro.p1": "Ich veröffentliche nicht alles, was ich mache – aber ich teile, was sich ehrlich anfühlt. Diese Arbeiten sind nicht immer fertig, aber sie sind immer wahrhaftig.",
  "arts.outro.p2": "Kreativität bedeutet für mich nicht, Talent zur Schau zu stellen. Es geht darum, zur Präsenz zurückzukehren. Aufmerksam zu sein. Die Intuition den Weg weisen zu lassen.",
  "arts.gallery.imageAlt": "Kunstbild",
  "arts.gallery.viewImageText": "Bild ansehen",

  "projects.title": "Meine Projekte",
  "projects.pageSubtitle": "Ausgewählte Arbeiten, Spielwiesen und Kollaborationen",
  "projects.introduction.title": "Einleitung",
  "projects.introduction.p1": "Diese Seite zeigt eine Auswahl digitaler und kultureller Projekte, an denen ich über die Jahre beteiligt war – von persönlichen Portfolio-Websites bis hin zu kollaborativen Festivalräumen und Filmarbeiten.",
  "projects.introduction.p2": "Ich ziele darauf ab, meine digitale Arbeit schlank, zugänglich und bedeutsam zu halten – und diese Webseite ist sowohl eine Experimentierplattform als auch eine Momentaufnahme meines sich entwickelnden Handwerks.",
  "projects.currentProject.title": "Aktuelles Projekt: Überarbeitung dieser Webseite",
  "projects.currentProject.description": "Dieses Portfolio ist ein fortlaufendes Projekt, erstellt, um mein Verständnis von serverseitigem Rendering mit Go und Templating zu vertiefen. Es ist ein Spielplatz für Experimente und eine saubere, schnelle und mehrsprachige Präsentation.",
  "projects.currentProject.motivation.label": "Motivation:",
  "projects.currentProject.motivation.text": "Go-Templating lernen, meine Online-Präsenz mit voller Kontrolle und minimalem Technologie-Stack neu aufbauen",
  "projects.currentProject.stack.label": "Technologie-Stack:",
  "projects.currentProject.stack.item1": "Go (Golang) + templ SSR-Templating",
  "projects.currentProject.stack.item2": "Gehostet auf Render",
  "projects.currentProject.stack.item3": "E-Mail-Service-Integration mit Resend",
  "projects.currentProject.stack.item4": "Sprachfallback und Routing (i18n)",
  "projects.currentProject.stack.item5": "Kein Framework – reines HTML, CSS und Logik",
  "projects.currentProject.linkGithubText": "GitHub Repo",

  "projects.websitesBuilt.title": "Erstellte Webseiten",
  "projects.websitesBuilt.jessebecker.name": "jessebecker.de",
  "projects.websitesBuilt.jessebecker.description": "Minimalistisches Künstlerportfolio in reinem HTML, CSS & JavaScript. Gebaut für Geschwindigkeit, Klarheit und langfristige Wartbarkeit.",
  "projects.websitesBuilt.arinashanzev.name": "arinashanzev.com (in Arbeit)",
  "projects.websitesBuilt.arinashanzev.description": "Ein WordPress-Portfolio für eine Praktizierende im Bereich Energiearbeit und Therapie, mit individuellem Theme und einem durchdachten Layout, das die Essenz ihrer Arbeit vermittelt.",
  "projects.websitesBuilt.berndwolf.name": "berndwolf.net (freiberufliche Unterstützung)",
  "projects.websitesBuilt.berndwolf.description": "Maßgeschneiderte WordPress-Anpassungen und funktionale Erweiterungen für das Künstlerportfolio von Bernd Wolf, mit Fokus auf nahtlose Integration und den Erhalt der Theme-Integrität.",
  "projects.websitesBuilt.evolveFestivalWebsite.name": "evolve-festival.com",
  "projects.websitesBuilt.evolveFestivalWebsite.description": "Neugestaltung der früheren Wix-basierten Festival-Webseite (Hinweis: Diese Version ist nicht mehr online), um Benutzerfreundlichkeit und Klarheit zu verbessern, eine klare Informationshierarchie zu schaffen und ein eingebettetes Ticketsystem zu integrieren.",
  "projects.websitesBuilt.oldPortfolio.name": "Alte Portfolio-Webseite (2022)",
  "projects.websitesBuilt.oldPortfolio.description": "Eine SPA Webseite in React und TailwindCSS. Diente als meine anfängliche Webpräsenz.",
  "projects.websitesBuilt.uskillity.name": "U/skillity (Prototyp)",
  "projects.websitesBuilt.uskillity.description": "Konzept einer Bildungsplattform – Mitbegründer und Hauptentwickler des MVP mit Benutzerverwaltung und Content-Publishing.",
  "projects.websitesBuilt.uskillity.linkInstagramText": "Uskillity auf Instagram",
  "projects.websitesBuilt.uskillity.linkFrontendRepoText": "Frontend Repo (GitHub)",
  "projects.websitesBuilt.uskillity.linkBackendRepoText": "Backend Repo (GitHub)",

  "projects.cultural.title": "Kulturelle & Kreative Projekte",
  "projects.cultural.kultschaette.name": "Kultstätte Keller (2011–2016)",
  "projects.cultural.kultschaette.p1": "Mitbegründer der Kultstätte Keller, eines lebendigen, hybriden Kulturraums in Berlin, der ein Yogastudio, Aufnahmemöglichkeiten, einen Club und einen Workshop-Ort beherbergte.",
  "projects.cultural.kultschaette.p2": "Federführend bei kreativer Leitung, Eventmanagement, technischer Infrastruktur und Kommunikation für diesen Community-Treffpunkt.",
  "projects.cultural.evolveFestivalSupport.name": "Evolve Festival (2024–2025)",
  "projects.cultural.evolveFestivalSupport.p1": "Organisatorische Unterstützung und Webseite-Relaunch für die Ausgabe 2023 – beteiligt an Kommunikation, Struktur und UX-Design.",
  "projects.cultural.vegetarischDeluxe.name": "Vegetarisch Deluxe (2006–2009)",
  "projects.cultural.vegetarischDeluxe.p1": "Bassist und Mitschöpfer dieser DIY-Punkband. Verantwortlich für Webseite, Booking und visuelle Inhalte.",

  "projects.film.title": "Filmprojekte",
  "projects.film.description": "Mitglied der Filmproduktionscrew bei verschiedenen Kurz- und Langfilmprojekten, hauptsächlich in den Bereichen Licht und Kamera.",
  "projects.film.linkCrewUnitedText": "Shawn Gordon Becker bei Crew United",

  "services.title": "Meine Leistungen",
  "services.pageSubtitle": "Digitales Handwerk, verwurzelt in Klarheit, Zweck und Ästhetik",
  "services.introduction.title": "Einleitung",
  "services.introduction.p1": "Ich biete durchdachte, schlanke und menschenzentrierte digitale Dienstleistungen – zugeschnitten auf Einzelpersonen, Teams und Organisationen, die Wert auf Klarheit, Qualität und bewusstes Design legen.",
  "services.introduction.p2": "Egal, ob Sie gerade erst anfangen oder Ihre bestehende Präsenz weiterentwickeln: Ich helfe Ihnen, digitale Erlebnisse zu schaffen, die sich nach Ihnen anfühlen.",

  "services.webDev.title": "Webentwicklung",
  "services.webDev.subDescription": "Maßgeschneiderte, schnelle und nachhaltige Webseiten – mit Sorgfalt erstellt.",
  "services.webDev.item1": "Frontend-Entwicklung mit HTML, CSS, JavaScript und React",
  "services.webDev.item2": "Statische Seiten oder dynamische Anwendungen – je nach Bedarf",
  "services.webDev.item3": "CMS-Integration (WordPress, Sanity, etc.)",
  "services.webDev.item4": "Mobilfreundlich, barrierefrei und schnell ladend",
  "services.webDev.item5": "SEO-bewusst und datenschutzfreundlich",
  "services.webDev.item6": "Sauberer Code, minimaler Ballast, zukunftssichere Setups",
  "services.webDev.tools.label": "Werkzeuge:",
  "services.webDev.tools.text": "HTML, CSS, JavaScript, ReactJS, NodeJS, Go, WordPress, TailwindCSS, Render, Vercel, GitHub",
  "services.webDev.linkToProjects": "Portfolio-Projekte ansehen →",

  "services.strategy.title": "Digitale Strategie & Produktentwicklung",
  "services.strategy.subDescription": "Von der Idee bis zum Launch – mit Struktur, Zweck und Nutzerperspektive.",
  "services.strategy.item1": "Klärung Ihres Kernangebots und Ihrer Zielgruppe",
  "services.strategy.item2": "Abbildung von Funktionen, Prioritäten und Abläufen",
  "services.strategy.item3": "Schlanke MVP-Planung und Festlegung des Umfangs",
  "services.strategy.item4": "UX- und UI-Audits für Klarheit und Benutzerfreundlichkeit",
  "services.strategy.item5": "Kollaborative Konzepterstellung mit einer ruhigen und agilen Denkweise",
  "services.strategy.background.label": "Hintergrund:",
  "services.strategy.background.text": "Produktstrategie, UX, Team-Moderation, Mitgründer-Erfahrung",
  "services.strategy.linkToProcess": "Erfahre mehr über meinen Prozess →",

  "services.ethicalTech.title": "Ethische & Nachhaltige Technologieberatung",
  "services.ethicalTech.subDescription": "Ihr Projekt soll mit Ihren Werten übereinstimmen? Das will ich auch. Lassen Sie uns Systeme entwerfen, die die Zeit, Aufmerksamkeit und Daten der Menschen respektieren.",
  "services.ethicalTech.item1": "Bewusste Technologieentscheidungen",
  "services.ethicalTech.item2": "Datenschutzorientierte Architektur",
  "services.ethicalTech.item3": "Grünes Hosting & leichtgewichtige Frameworks",
  "services.ethicalTech.item4": "Überprüfungen auf Barrierefreiheit und Inklusivität",
  "services.ethicalTech.item5": "Durchdachte Skalierung und Wartung",
  "services.ethicalTech.relevantFor.label": "Besonders relevant für:",
  "services.ethicalTech.relevantFor.text": "gemeinnützige Organisationen, kulturelle Initiativen, regenerative Unternehmen und ethische Startups",

  "services.howIWork.title": "Meine Arbeitsweise",
  "services.howIWork.subDescription": "Kollaborativ, transparent und werteorientiert.",
  "services.howIWork.p1": "Ich übernehme nur wenige ausgewählte Projekte gleichzeitig, um Fokus und Integrität zu gewährleisten.",
  "services.howIWork.p2": "Wenn Sie denken, dass wir gut zusammenpassen – ich würde mich freuen, von Ihnen zu hören.",
  "services.howIWork.linkToContact": "Lassen Sie uns reden → Kontakt aufnehmen",

  "contact.title": "Kontakt",
  "contact.subtitle": "Melde dich – mit einer Idee, einer Frage oder einfach aus Neugier.",
  "contact.intro.p1": "Ich bin immer offen für Gespräche – egal, ob du zusammenarbeiten möchtest, Unterstützung für ein digitales Projekt benötigst oder dich einfach von etwas angezogen fühlst, das du hier gesehen hast.",
  "contact.intro.p2": "Du brauchst keinen ausgefeilten Pitch. Eine einfache Nachricht genügt. Ich schätze echte menschliche Verbindungen und gebe mein Bestes, auf jede Anfrage persönlich zu antworten.",
  "contact.form.firstname.label": "Vorname:",
  "contact.form.lastname.label": "Nachname:",
  "contact.form.email.label": "E-Mail:",
  "contact.form.phone.label": "Telefon (optional):",
  "contact.form.service.label": "Leistung (optional):",
  "contact.form.service.option.select": "Bitte wählen...",
  "contact.form.service.option.development": "Entwicklung",
  "contact.form.service.option.consulting": "Beratung",
  "contact.form.service.option.productManagement": "Produktmanagement",
  "contact.form.service.option.other": "Andere",
  "contact.form.message.label": "Ihre Nachricht:",
  "contact.form.submitButton": "Nachricht senden",
  "contact.form.loadingIndicator": "Wird gesendet...",
  "contact.reachOutIf.title": "Du könntest dich melden, wenn:",
  "contact.reachOutIf.item1": "Du an einem Web- oder Kreativprojekt mitarbeiten möchtest",
  "contact.reachOutIf.item2": "Du etwas Durchdachtes baust und einen Entwickler oder Strategen benötigst",
  "contact.reachOutIf.item3": "Du dich mit digitaler Ethik oder nachhaltigen Technologiepraktiken beschäftigst",
  "contact.reachOutIf.item4": "Du einfach etwas teilen möchtest – einen Gedanken, einen Link, eine Idee",
  "contact.outro.p1": "Mal sehen, wohin das Gespräch führt.",
  "contact.error.internal": "Ein interner Fehler ist aufgetreten. Bitte versuche es später erneut.",
  "contact.error.requiredFields": "Bitte fülle alle Pflichtfelder aus (Vorname, Nachname, E-Mail und Nachricht).",
  "contact.error.configIssue": "Ihre Nachricht konnte aufgrund eines Serverkonfigurationsproblems nicht gesendet werden. Bitte verwenden Sie die E-Mail-Adresse in der Fußzeile.",
  "contact.error.sendFail": "Ihre Nachricht konnte nicht gesendet werden. Bitte versuchen Sie es später erneut oder verwenden Sie die E-Mail-Adresse in der Fußzeile.",
  "contact.success.messageSent": "Ihre Nachricht wurde erfolgreich gesendet! Ich melde mich so schnell wie möglich bei Ihnen.",
  "contact.methodNotAllowed": "Methode nicht erlaubt",
  "arts.error.loadImages": "Bilder für den Kunstbereich konnten nicht geladen werden.",

  "home.pageTitle": "Shawn Gordon Becker - Fullstack Entwickler & Digital Product Thinker",
  "home.pageMetaDescription": "Shawn Gordon Becker: Fullstack Web Entwickler & Digital Product Thinker. Entdecken Sie digitale Lösungen mit Substanz – an der Schnittstelle von Code, Konzept und Ästhetik.",

  "about.pageTitle": "Über Mich - Shawn Gordon Becker",
  "about.pageMetaDescription": "Lernen Sie Shawn Gordon Becker kennen: Fullstack Entwickler & Digital Product Thinker. Entdecken Sie seinen Weg, seine Philosophie und seinen Antrieb für klare, zielgerichtete digitale Lösungen.",

  "services.pageTitle": "Leistungen - Shawn Gordon Becker",
  "services.pageMetaDescription": "Entdecken Sie die digitalen Services von Shawn Gordon Becker: Individuelle Webentwicklung, Produktstrategie und ethische Tech-Beratung – mit Fokus auf Klarheit, Sinn und Ästhetik.",

  "projects.pageTitle": "Projekte - Shawn Gordon Becker",
  "projects.pageMetaDescription": "Ausgewählte digitale und kulturelle Projekte von Shawn Gordon Becker. Einblicke in Fullstack Webentwicklung, Product Thinking und kollaborative Arbeiten.",

  "arts.pageTitle": "Kunst - Shawn Gordon Becker",
  "arts.pageMetaDescription": "Einblicke in die kreativen Arbeiten von Shawn Gordon Becker – Erkundungen in Fotografie, Sound und Skizzen, die eine einzigartige Perspektive auf die Welt zeigen.",

  "contact.pageTitle": "Kontakt - Shawn Gordon Becker",
  "contact.pageMetaDescription": "Nehmen Sie Kontakt mit Shawn Gordon Becker auf. Für Projektanfragen, Ideenaustausch oder eine mögliche Zusammenarbeit im Bereich Webentwicklung und Digitalstrategie."
}
