{
  "langCode": "de",
  "site.title": "Shawn Gordon Becker",
  "nav.about": "Über mich",
  "nav.experience": "Erfahrung",
  "nav.projects": "Projekte",
  "nav.arts": "Kunst",
  "nav.contact": "Kontakt",

  "common.downloadCV": "Lebenslauf herunterladen (PDF)",
  "common.githubProfile": "GitHub Profil",
  "common.linkedinProfile": "LinkedIn Profil",

  "home.hero.nameVisual": "Shawn Gordon Becker",
  "home.hero.taglineVisual": "BEDEUTUNG",
  "home.hero.taglineVisual2": "FORM",
  "home.hero.taglineVisual3": "CODE",
  "home.hero.subIntroText": "Full-Stack Entwickler mit Produktdenken – Entwicklung skalierbarer Webanwendungen mit technischer Exzellenz und Nutzerfokus.",
  "home.intro.p1": "Diese Seite ist mehr als ein Portfolio. Sie ist ein wachsender Spiegel meines Weges.",
  "home.intro.p2": "Hier findest du ausgewählte Projekte, Gedanken und Experimente an der Schnittstelle von Kunst und Technologie.",
  "home.cta.projects": "Projekte ansehen",
  "home.cta.experience": "Erfahrung ansehen",
  "home.cta.about": "Mehr über mich",
  "home.cta.downloadCV": "Lebenslauf herunterladen (PDF)",

  "about.title": "Über Mich",
  "about.pageSubtitle": "Zwischen Code und Sinn: Ein Entwickler mit Klarheit und Tiefe.",
  "about.greeting.title": "Hi, ich bin Shawn.",
  "about.greeting.p1": "Ich bin Fullstack-Webentwickler und digitaler Produktdenker – ich verbinde technische Präzision mit Gespür für Design. Ich denke digitale Produkte immer auch aus der Sicht der Nutzer:innen. Ich gestalte digitale Erlebnisse, die von Integrität geprägt sind – klar, zielgerichtet und fundiert.",
  "about.greeting.p2": "Mich interessieren einfache, durchdachte und nachhaltige Lösungen. Lieber leise und echt als laut und glatt.",
  "about.greeting.p3": "Ich arbeite ruhig, mit klarem Blick und viel Fokus. Ich erkenne Muster, verstehe Systeme – und versuche, Dinge zu entwickeln, die wirklich etwas verändern.",

  "about.path.title": "Mein Weg",
  "about.path.p1": "Mein Weg war nicht linear. Er begann irgendwo zwischen Musik und Code, Filmsets und Neugier. Studien in Marketing und Informatik legten das Fundament – verbunden hat sich alles später in meinem Studium an der CODE University: Struktur, Empathie, Sinn.",
  "about.path.p2": "Ich war in verschiedenen Rollen unterwegs – als Entwickler, Produktdenker, Mitgestalter in digitalen und kulturellen Kontexten. Ich arbeitete mit Startups wie YPTOKEY und Data4Life, gründete 2016 U/skillity (eine Plattform für geteiltes Wissen, seit 2021 pausiert) und die Kultstätte Keller – ein Raum für Kunst, Klang und Gemeinschaft. Zwischendurch war ich immer wieder bei Filmproduktionen, meist als Assistent hinter den Kulissen. Diese Erfahrungen waren bodenständig, aber prägend – für mein Verständnis von Zusammenarbeit, Timing und Präsenz.",

  "about.drivesMe.title": "Was mich antreibt",
  "about.drivesMe.item1.title": "Klarheit & Stimmigkeit:",
  "about.drivesMe.item1.text": "Ich entwerfe Systeme und Interaktionen, die ruhig, nachvollziehbar und logisch sind. Unstimmigkeiten fallen mir früh auf – und ich suche nach Klarheit als Antwort.",
  "about.drivesMe.item2.title": "Mensch & Werte:",
  "about.drivesMe.item2.text": "Technologie sollte Menschen dienen – nicht sie ablenken. Ich entwickle mit Respekt für Zeit, Aufmerksamkeit und Vertrauen.",
  "about.drivesMe.item3.title": "Lernen & Machen:",
  "about.drivesMe.item3.text": "Neugier ist mein Antrieb. Ich glaube ans Lernen durchs Machen – und ans Hinterfragen des Gewohnten.",
  "about.drivesMe.item4.title": "Ästhetik & Handwerk:",
  "about.drivesMe.item4.text": "Form ist mir genauso wichtig wie Funktion. Durchdachte Details, feine Entscheidungen – sie machen den Unterschied. Schönheit zeigt für mich: Da hat sich jemand wirklich gekümmert.",

  "about.skillset.title": "Kernkompetenzen & Technologien",
  "about.skillset.devFullstack.title": "Fullstack Webentwicklung",
  "about.skillset.devFullstack.skills": "JavaScript/TypeScript (React, Node.js), Go, HTML5, CSS3, API-Entwicklung, Datenbanken (MySQL, MongoDB), CMS (WordPress, Headless CMS)",
  "about.skillset.productStrategy.title": "Digitales Produktmanagement & Strategie",
  "about.skillset.productStrategy.skills": "Produktstrategie, Agile Methoden (Scrum, Kanban), Nutzerforschung & Testing (konzeptionell), UX-Konzeption & User Journey Mapping, Anforderungsmanagement, Feature-Priorisierung, MVP-Planung, Technisches Projektmanagement, Teammoderation",
  "about.skillset.ethicalConsulting.title": "Beratung für ethische & nachhaltige Technologie",
  "about.skillset.ethicalConsulting.skills": "Bewusste Technologieentscheidungen, Privacy-by-Design, Barrierefreiheit (WCAG), Green-IT-Ansätze, Wartungsstrategien",

  "about.outsideScreen.title": "Abseits vom Bildschirm",
  "about.outsideScreen.p1": "Wenn ich nicht gerade baue oder konzipiere, beschäftige ich mich mit Musik (hörend und produzierend), fermentiere Wasserkefir, fahre lange Strecken mit dem Rad oder bin einfach draußen in der Natur. Neuerdings entdecke ich auch die Fotografie – langsam, aus dem Gefühl heraus.",
  "about.outsideScreen.p2": "Ich lebe in Berlin und bin offen für sinnvolle, ortsunabhängige Zusammenarbeit weltweit.",

  "about.lookingFor.title": "Wonach ich suche",
  "about.lookingFor.p1": "Ich suche nach Möglichkeiten bei produktorientierten Unternehmen, bei denen technische Exzellenz auf sinnvolle Wirkung trifft. Ich arbeite am besten in Umgebungen, die folgendes schätzen:",
  "about.lookingFor.item1": "Saubere Architektur und wartbare Codebasen",
  "about.lookingFor.item2": "Funktionsübergreifende Zusammenarbeit zwischen Engineering, Produkt und Design",
  "about.lookingFor.item3": "Kontinuierliches Lernen und Wissensaustausch",
  "about.lookingFor.item4": "Produkte entwickeln, die das Leben von Menschen wirklich verbessern",
  "about.lookingFor.p2": "Ideale Teamgröße: 10-50 Personen. Ideale Rolle: Full-Stack Entwickler oder Backend-fokussierte Position mit Raum für Produktdenken.",
  "about.lookingFor.p3": "Standort: Berlin-basiert mit Offenheit für hybride/remote Setups.",
  "about.lookingFor.availability": "Verfügbarkeit: Offen für Gespräche über Timing",
  "about.lookingFor.ctaDownload": "Lebenslauf herunterladen (PDF)",

  "about.connect.title": "Lass uns in Kontakt kommen",
  "about.connect.p1": "Wenn dich etwas davon anspricht – ob du eine Projektidee hast, Gedanken austauschen oder gemeinsam etwas bewegen willst – schreib mir gerne:",
  "about.connect.ctaText": "Zur Kontaktseite",
  "about.connect.githubLinkText": "Mein GitHub-Profil",

  "arts.title": "Kunst",
  "arts.subtitle": "Jenseits des Codes: Kreative Arbeit & Fotografie – Erkundung ohne Ergebnis, nur Präsenz, Übung und Spiel.",
  "arts.intro.p1": "Bevor ich Code schrieb, machte ich Musik. Bevor ich Oberflächen gestaltete, folgte ich dem Licht durch eine Linse. Kunst ist für mich keine separate Kategorie – sie ist eine andere Art, der Welt zuzuhören.",
  "arts.intro.p2": "Dieser Bereich ist ein Fenster in die kreative Seite meines Lebens:",
  "arts.photography.title": "Fotografie:",
  "arts.photography.text": "Fragmente von Licht, Architektur, Stimmung und Bewegung",
  "arts.sound.title": "Klang & Musik:",
  "arts.sound.text": "analoge und digitale Erkundungen, Ambient-Kompositionen, klangliches Tagebuchschreiben",
  "arts.sketches.title": "Skizzen & Studien:",
  "arts.sketches.text": "visuelle Experimente, Layout-Erkundungen, eingefangene Atmosphären",
  "arts.outro.p1": "Ich veröffentliche nicht alles, was ich mache – aber ich teile, was sich ehrlich anfühlt. Diese Arbeiten sind nicht immer fertig, aber sie sind immer wahrhaftig.",
  "arts.outro.p2": "Kreativität bedeutet für mich nicht, Talent zur Schau zu stellen. Es geht darum, zur Präsenz zurückzukehren. Aufmerksam zu sein. Die Intuition den Weg weisen zu lassen.",
  "arts.gallery.imageAlt": "Kunstbild",
  "arts.gallery.viewImageText": "Bild ansehen",

  "projects.title": "Meine Projekte",
  "projects.pageSubtitle": "Ausgewählte Arbeiten, Spielwiesen und Kollaborationen",
  "projects.introduction.title": "Einleitung",
  "projects.introduction.p1": "Diese Seite zeigt eine Auswahl digitaler und kultureller Projekte, an denen ich über die Jahre beteiligt war – von persönlichen Portfolio-Websites bis hin zu kollaborativen Festivalräumen und Filmarbeiten.",
  "projects.introduction.p2": "Ich ziele darauf ab, meine digitale Arbeit schlank, zugänglich und bedeutsam zu halten – und diese Webseite ist sowohl eine Experimentierplattform als auch eine Momentaufnahme meines sich entwickelnden Handwerks.",
  "projects.currentProject.title": "Aktuelles Projekt: Überarbeitung dieser Webseite",
  "projects.currentProject.description": "Dieses Portfolio ist ein fortlaufendes Projekt, erstellt, um mein Verständnis von serverseitigem Rendering mit Go und Templating zu vertiefen. Es ist ein Spielplatz für Experimente und eine saubere, schnelle und mehrsprachige Präsentation.",
  "projects.currentProject.motivation.label": "Motivation:",
  "projects.currentProject.motivation.text": "Go-Templating lernen, meine Online-Präsenz mit voller Kontrolle und minimalem Technologie-Stack neu aufbauen",
  "projects.currentProject.stack.label": "Technologie-Stack:",
  "projects.currentProject.stack.item1": "Go (Golang) + templ SSR-Templating",
  "projects.currentProject.stack.item2": "Gehostet auf Render",
  "projects.currentProject.stack.item3": "E-Mail-Service-Integration mit Resend",
  "projects.currentProject.stack.item4": "Sprachfallback und Routing (i18n)",
  "projects.currentProject.stack.item5": "Kein Framework – reines HTML, CSS und Logik",
  "projects.currentProject.linkGithubText": "GitHub Repo",

  "projects.websitesBuilt.title": "Erstellte Webseiten",
  "projects.websitesBuilt.jessebecker.name": "jessebecker.de",
  "projects.websitesBuilt.jessebecker.description": "Minimalistisches Künstlerportfolio in reinem HTML, CSS & JavaScript. Gebaut für Geschwindigkeit, Klarheit und langfristige Wartbarkeit.",
  "projects.websitesBuilt.arinashanzev.name": "arinashanzev.com (in Arbeit)",
  "projects.websitesBuilt.arinashanzev.description": "Ein WordPress-Portfolio für eine Praktizierende im Bereich Energiearbeit und Therapie, mit individuellem Theme und einem durchdachten Layout, das die Essenz ihrer Arbeit vermittelt.",
  "projects.websitesBuilt.berndwolf.name": "berndwolf.net (freiberufliche Unterstützung)",
  "projects.websitesBuilt.berndwolf.description": "Maßgeschneiderte WordPress-Anpassungen und funktionale Erweiterungen für das Künstlerportfolio von Bernd Wolf, mit Fokus auf nahtlose Integration und den Erhalt der Theme-Integrität.",
  "projects.websitesBuilt.evolveFestivalWebsite.name": "evolve-festival.com",
  "projects.websitesBuilt.evolveFestivalWebsite.description": "Neugestaltung der früheren Wix-basierten Festival-Webseite (Hinweis: Diese Version ist nicht mehr online), um Benutzerfreundlichkeit und Klarheit zu verbessern, eine klare Informationshierarchie zu schaffen und ein eingebettetes Ticketsystem zu integrieren.",
  "projects.websitesBuilt.oldPortfolio.name": "Alte Portfolio-Webseite (2022)",
  "projects.websitesBuilt.oldPortfolio.description": "Eine SPA Webseite in React und TailwindCSS. Diente als meine anfängliche Webpräsenz.",
  "projects.websitesBuilt.uskillity.name": "U/skillity (Prototyp)",
  "projects.websitesBuilt.uskillity.description": "Konzept einer Bildungsplattform – Mitbegründer und Hauptentwickler des MVP mit Benutzerverwaltung und Content-Publishing.",
  "projects.websitesBuilt.uskillity.linkInstagramText": "Uskillity auf Instagram",
  "projects.websitesBuilt.uskillity.linkFrontendRepoText": "Frontend Repo (GitHub)",
  "projects.websitesBuilt.uskillity.linkBackendRepoText": "Backend Repo (GitHub)",

  "projects.cultural.title": "Kulturelle & Kreative Projekte",
  "projects.cultural.kultschaette.name": "Kultstätte Keller (2011–2016)",
  "projects.cultural.kultschaette.p1": "Mitbegründer der Kultstätte Keller, eines lebendigen, hybriden Kulturraums in Berlin, der ein Yogastudio, Aufnahmemöglichkeiten, einen Club und einen Workshop-Ort beherbergte.",
  "projects.cultural.kultschaette.p2": "Federführend bei kreativer Leitung, Eventmanagement, technischer Infrastruktur und Kommunikation für diesen Community-Treffpunkt.",
  "projects.cultural.evolveFestivalSupport.name": "Evolve Festival (2024–2025)",
  "projects.cultural.evolveFestivalSupport.p1": "Organisatorische Unterstützung und Webseite-Relaunch für die Ausgabe 2023 – beteiligt an Kommunikation, Struktur und UX-Design.",
  "projects.cultural.vegetarischDeluxe.name": "Vegetarisch Deluxe (2006–2009)",
  "projects.cultural.vegetarischDeluxe.p1": "Bassist und Mitschöpfer dieser DIY-Punkband. Verantwortlich für Webseite, Booking und visuelle Inhalte.",

  "projects.film.title": "Filmprojekte",
  "projects.film.description": "Mitglied der Filmproduktionscrew bei verschiedenen Kurz- und Langfilmprojekten, hauptsächlich in den Bereichen Licht und Kamera.",
  "projects.film.linkCrewUnitedText": "Shawn Gordon Becker bei Crew United",

  "experience.title": "Erfahrung",
  "experience.pageSubtitle": "7+ Jahre Digitale Produkte Entwickeln — Von Code bis Strategie",
  "experience.introduction.title": "Berufliches Profil",
  "experience.introduction.p1": "Ein vielseitiger Full-Stack-Entwickler mit über 7 Jahren praktischer Erfahrung in Frontend- und Backend-Entwicklung, Produktmanagement und digitaler Strategie. Meine Karriere verbindet technische Umsetzung mit Produktdenken — ich entwickle skalierbare, wartbare Anwendungen und stelle dabei Nutzer und Geschäftsziele in den Mittelpunkt.",
  "experience.introduction.p2": "Aktuell erweitere ich meine Expertise in fortgeschrittenen Webentwicklungsmethoden, Performance-Optimierung und modernen Deployment-Praktiken durch Neue Fishe's Advanced Web Development Programm.",
  "experience.introduction.p3": "Ich gedeihe in funktionsübergreifenden Teams, in denen Engineering auf Design und Produktstrategie trifft, und bringe sowohl technische Tiefe als auch strategische Klarheit in jedes Projekt.",

  "experience.timeline.title": "Beruflicher Werdegang",

  "experience.freelance.title": "Freelance Web Developer & Berater",
  "experience.freelance.company": "Selbstständig",
  "experience.freelance.period": "Jan 2023 - Heute",
  "experience.freelance.location": "Berlin, Deutschland",
  "experience.freelance.item1": "Full-Stack-Weblösungen mit Fokus auf langfristige Wartbarkeit, Barrierefreiheit und saubere Architektur",
  "experience.freelance.item2": "CMS-Plattformentwicklung und -anpassung (WordPress, Headless CMS-Lösungen)",
  "experience.freelance.item3": "Digitale Produktberatung für kreative Fachleute und kulturelle Projekte",
  "experience.freelance.item4": "Strategische Beratung zu nachhaltigen Technologieentscheidungen, Privacy-by-Design und ethischer Entwicklung",
  "experience.freelance.tech": "React, TypeScript, Go, Node.js, WordPress, HTML/CSS",

  "experience.freiheit.title": "Full-Stack Developer",
  "experience.freiheit.company": "Freiheit.software",
  "experience.freiheit.period": "Mai 2021 - Nov 2022",
  "experience.freiheit.location": "Potsdam, Deutschland",
  "experience.freiheit.item1": "Entwicklung skalierbarer Webanwendungen mit React, Node.js und TypeScript für Unternehmenskunden verschiedener Branchen",
  "experience.freiheit.item2": "Förderung komponentenbasierter Entwicklung, Barrierefreiheitsstandards (WCAG) und inklusiver Designpraktiken",
  "experience.freiheit.item3": "Mitwirkung an Architekturplanung, Durchführung gründlicher Code-Reviews und Optimierung der Anwendungsperformance",
  "experience.freiheit.item4": "Enge Zusammenarbeit mit Designern und Produktmanagern zur Lieferung nutzerzentrierter Lösungen",
  "experience.freiheit.tech": "React, TypeScript, Node.js, PostgreSQL, REST APIs",

  "experience.data4life.title": "Technical Project Manager",
  "experience.data4life.company": "Data4Life gGmbH",
  "experience.data4life.period": "Feb 2021 - Mai 2021",
  "experience.data4life.location": "Berlin, Deutschland",
  "experience.data4life.item1": "Leitung funktionsübergreifender Produktteams im Digital Health, Förderung der Zusammenarbeit zwischen Engineering, Design und Research",
  "experience.data4life.item2": "Unterstützung der C-Level-Führung bei Produktausrichtung, Roadmap-Priorisierung und Organisationskulturentwicklung",
  "experience.data4life.item3": "Moderation agiler Zeremonien (Sprint Planning, Retrospektiven, Daily Standups) und Verbesserung von Team-Workflows",
  "experience.data4life.item4": "Vermittlung zwischen technischen und nicht-technischen Stakeholdern, Übersetzung von Geschäftsanforderungen in umsetzbare Entwicklungsaufgaben",
  "experience.data4life.tech": "Agile (Scrum), Produktstrategie, Stakeholder Management, JIRA",

  "experience.yptokey.title": "Product Owner & Frontend Developer",
  "experience.yptokey.company": "Yptokey GmbH",
  "experience.yptokey.period": "Okt 2018 - Juni 2020",
  "experience.yptokey.location": "Berlin, Deutschland",
  "experience.yptokey.item1": "Entwicklung React-basierter Frontends für Blockchain-gestützte IoT-Zugangskontrollsysteme mit modernen Web3-Technologien",
  "experience.yptokey.item2": "Verantwortung für Produktvision, umfassende Dokumentation und Koordination von Release-Roadmaps für mehrere Proof-of-Concept-Iterationen",
  "experience.yptokey.item3": "Validierung von Prototypen durch Nutzertests und Ausbalancierung technischer Machbarkeit mit Nutzerbedürfnissen im frühen Startup-Umfeld",
  "experience.yptokey.item4": "Zusammenarbeit mit Hardware-Ingenieuren und Blockchain-Spezialisten zur Schaffung nahtloser Nutzererlebnisse",
  "experience.yptokey.tech": "React, JavaScript, Blockchain (Ethereum), IoT, Produktmanagement",

  "experience.refund.title": "Online Marketing Manager & Web Developer",
  "experience.refund.company": "Refund.me GmbH",
  "experience.refund.period": "Mai 2017 - Sept 2018",
  "experience.refund.location": "Berlin, Deutschland",
  "experience.refund.item1": "Konzeption und Umsetzung digitaler Marketingstrategien für ein schnell wachsendes Fintech-Startup",
  "experience.refund.item2": "Entwicklung und Pflege der Unternehmenswebsite und Landing Pages mit Optimierung für Conversion und SEO",
  "experience.refund.item3": "Verwaltung von Multi-Channel-Kampagnen (E-Mail, Social Media, bezahlte Werbung) und Analyse von Performance-Metriken",
  "experience.refund.item4": "Zusammenarbeit mit Vertriebs- und Produktteams zur Abstimmung von Marketinginitiativen mit Geschäftszielen",
  "experience.refund.tech": "HTML, CSS, JavaScript, WordPress, Google Analytics, SEO",

  "experience.uskillity.title": "Mitgründer & Lead Developer",
  "experience.uskillity.company": "U/skillity",
  "experience.uskillity.period": "2016 - 2018",
  "experience.uskillity.location": "Berlin, Deutschland",
  "experience.uskillity.item1": "Mitgründung einer Bildungsplattform mit Fokus auf Peer-to-Peer-Wissensaustausch und Kompetenzentwicklung",
  "experience.uskillity.item2": "Leitung der technischen Entwicklung des MVP inklusive Nutzerauthentifizierung, Content Management und Publishing-Workflows",
  "experience.uskillity.item3": "Definition der Produktvision, Durchführung von Nutzerforschung und Iteration basierend auf Community-Feedback",
  "experience.uskillity.item4": "Verwaltung eines kleinen Entwicklungsteams und Koordination mit Design- und Content-Partnern",
  "experience.uskillity.tech": "React, Node.js, MongoDB, User Research, MVP-Entwicklung",

  "experience.kultstaette.title": "Mitgründer & Creative Director",
  "experience.kultstaette.company": "Kultstätte Keller",
  "experience.kultstaette.period": "2011 - 2016",
  "experience.kultstaette.location": "Berlin, Deutschland",
  "experience.kultstaette.item1": "Mitgründung und Betrieb eines vielseitigen Kulturraums mit Yoga-Studio, Aufnahmeeinrichtungen, Veranstaltungsort und Workshop-Räumen",
  "experience.kultstaette.item2": "Verwaltung der gesamten technischen Infrastruktur, Eventproduktion und digitalen Kommunikation für über 2.000 jährliche Besucher",
  "experience.kultstaette.item3": "Koordination vielfältiger Programmierung inklusive Konzerte, Workshops, Yoga-Kurse und Community-Zusammenkünfte",
  "experience.kultstaette.item4": "Aufbau eines nachhaltigen Geschäftsmodells mit Balance zwischen kultureller Mission und finanzieller Tragfähigkeit",
  "experience.kultstaette.tech": "Event Management, Community Building, Technische Produktion",

  "experience.education.title": "Bildung & Kontinuierliches Lernen",

  "experience.education.neueFische.title": "Advanced Web Development",
  "experience.education.neueFische.institution": "Neue Fische GmbH",
  "experience.education.neueFische.period": "2025 - Heute",
  "experience.education.neueFische.location": "Berlin, Deutschland",
  "experience.education.neueFische.description": "Intensives 12-Wochen-Bootcamp mit Fokus auf fortgeschrittenes JavaScript, React-Ökosysteme, Testing-Methodologien, Performance-Optimierung und moderne Deployment-Strategien. Vertiefung der Expertise in skalierbaren Architekturmustern und KI-gestützten Entwicklungs-Workflows.",
  "experience.education.neueFische.focus": "Advanced JavaScript, React, Testing, Performance, Deployment, AI Integration",

  "experience.education.code.title": "Produktmanagement",
  "experience.education.code.institution": "CODE University of Applied Sciences",
  "experience.education.code.period": "2020 - 2021",
  "experience.education.code.location": "Berlin, Deutschland",
  "experience.education.code.description": "Spezialisiertes Studium in digitalem Produktmanagement, agilen Methoden, User Research und Produktstrategie. Verbindung von technischem Wissen mit betriebswirtschaftlichem Verständnis und nutzerzentrierten Designprinzipien.",
  "experience.education.code.focus": "Produktstrategie, Agile, UX Research, Roadmap-Planung",

  "experience.education.mci.title": "Marketing & Communications Management",
  "experience.education.mci.institution": "MCI - The Entrepreneurial School",
  "experience.education.mci.period": "2012 - 2016",
  "experience.education.mci.location": "Innsbruck, Österreich",
  "experience.education.mci.description": "Bachelor-Abschluss mit Kombination aus Marketingstrategie, digitaler Kommunikation und Medieninformatik. Entwicklung einer starken Grundlage in Nutzerpsychologie, Markenstrategie und datengetriebener Entscheidungsfindung.",
  "experience.education.mci.focus": "Marketing, Digitale Strategie, Medieninformatik",

  "experience.skills.title": "Technische Expertise",
  "experience.skills.intro": "Ein umfassendes Toolkit, aufgebaut durch Jahre praktischer Entwicklung, kontinuierliches Lernen und interdisziplinäre Zusammenarbeit.",

  "experience.skills.frontend.title": "Frontend-Entwicklung",
  "experience.skills.frontend.expert": "Experte:",
  "experience.skills.frontend.expertList": "React, TypeScript, JavaScript (ES6+), HTML5, CSS3, Responsive Design",
  "experience.skills.frontend.proficient": "Fortgeschritten:",
  "experience.skills.frontend.proficientList": "Component Libraries, State Management (Redux, Context API), Accessibility (WCAG), Performance-Optimierung",

  "experience.skills.backend.title": "Backend-Entwicklung",
  "experience.skills.backend.expert": "Experte:",
  "experience.skills.backend.expertList": "Node.js, Express, RESTful APIs, PostgreSQL, MongoDB",
  "experience.skills.backend.proficient": "Fortgeschritten:",
  "experience.skills.backend.proficientList": "Go (Golang), Python, Datenbankdesign, Authentifizierung & Autorisierung, API-Sicherheit",

  "experience.skills.tools.title": "Tools & Plattformen",
  "experience.skills.tools.expert": "Experte:",
  "experience.skills.tools.expertList": "Git, GitHub, VS Code, npm/yarn, Chrome DevTools",
  "experience.skills.tools.proficient": "Fortgeschritten:",
  "experience.skills.tools.proficientList": "Docker, AWS, CI/CD Pipelines, Figma, WordPress, Testing Frameworks (Jest, React Testing Library)",

  "experience.skills.product.title": "Produkt & Strategie",
  "experience.skills.product.list": "Agile Methodologien (Scrum, Kanban), Product Roadmapping, User Research & Testing, Requirements Management, Feature-Priorisierung, Stakeholder-Kommunikation, Team-Facilitation, MVP-Entwicklung",

  "experience.skills.soft.title": "Berufliche Kompetenzen",
  "experience.skills.soft.list": "Funktionsübergreifende Zusammenarbeit, Technische Kommunikation, Code Review, Mentoring, Problemlösung, Systemdenken, Detailgenauigkeit, Kontinuierliches Lernen",

  "experience.cta.downloadCV": "Vollständigen Lebenslauf herunterladen (PDF)",
  "experience.cta.viewProjects": "Projekt-Portfolio erkunden →",

  "contact.title": "Kontakt",
  "contact.subtitle": "Melde dich – mit einer Idee, einer Frage oder einfach aus Neugier.",
  "contact.details.title": "Kontaktinformationen",
  "contact.intro.p1": "Ich bin immer offen für Gespräche – egal, ob du zusammenarbeiten möchtest, Unterstützung für ein digitales Projekt benötigst oder dich einfach von etwas angezogen fühlst, das du hier gesehen hast.",
  "contact.intro.p2": "Du brauchst keinen ausgefeilten Pitch. Eine einfache Nachricht genügt. Ich schätze echte menschliche Verbindungen und gebe mein Bestes, auf jede Anfrage persönlich zu antworten.",
  "contact.intro.availability": "Offen für Festanstellungen (sozialversicherungspflichtig) in Berlin und interessante Remote-Möglichkeiten.",
  "contact.form.firstname.label": "Vorname:",
  "contact.form.lastname.label": "Nachname:",
  "contact.form.email.label": "E-Mail:",
  "contact.form.phone.label": "Telefon (optional):",
  "contact.form.service.label": "Leistung (optional):",
  "contact.form.service.option.select": "Bitte wählen...",
  "contact.form.service.option.development": "Entwicklung",
  "contact.form.service.option.consulting": "Beratung",
  "contact.form.service.option.productManagement": "Produktmanagement",
  "contact.form.service.option.other": "Andere",
  "contact.form.message.label": "Ihre Nachricht:",
  "contact.form.submitButton": "Nachricht senden",
  "contact.form.loadingIndicator": "Wird gesendet...",
  "contact.reachOutIf.title": "Du könntest dich melden, wenn:",
  "contact.reachOutIf.item1": "Du einen Full-Stack oder Backend-Entwickler in Berlin suchst",
  "contact.reachOutIf.item2": "Du an einem Web- oder Kreativprojekt mitarbeiten möchtest",
  "contact.reachOutIf.item3": "Du etwas Durchdachtes baust und einen Entwickler oder Strategen benötigst",
  "contact.reachOutIf.item4": "Du dich mit digitaler Ethik oder nachhaltigen Technologiepraktiken beschäftigst",
  "contact.reachOutIf.item5": "Du einfach etwas teilen möchtest – einen Gedanken, einen Link, eine Idee",
  "contact.outro.p1": "Mal sehen, wohin das Gespräch führt.",
  "contact.error.internal": "Ein interner Fehler ist aufgetreten. Bitte versuche es später erneut.",
  "contact.error.requiredFields": "Bitte fülle alle Pflichtfelder aus (Vorname, Nachname, E-Mail und Nachricht).",
  "contact.error.configIssue": "Ihre Nachricht konnte aufgrund eines Serverkonfigurationsproblems nicht gesendet werden. Bitte verwenden Sie die E-Mail-Adresse in der Fußzeile.",
  "contact.error.sendFail": "Ihre Nachricht konnte nicht gesendet werden. Bitte versuchen Sie es später erneut oder verwenden Sie die E-Mail-Adresse in der Fußzeile.",
  "contact.success.messageSent": "Ihre Nachricht wurde erfolgreich gesendet! Ich melde mich so schnell wie möglich bei Ihnen.",
  "contact.methodNotAllowed": "Methode nicht erlaubt",
  "arts.error.loadImages": "Bilder für den Kunstbereich konnten nicht geladen werden.",

  "home.pageTitle": "Shawn Gordon Becker - Fullstack Entwickler & Digital Product Thinker",
  "home.pageMetaDescription": "Shawn Gordon Becker: Fullstack Web Entwickler & Digital Product Thinker. Entdecken Sie digitale Lösungen mit Substanz – an der Schnittstelle von Code, Konzept und Ästhetik.",

  "about.pageTitle": "Über Mich - Shawn Gordon Becker",
  "about.pageMetaDescription": "Lernen Sie Shawn Gordon Becker kennen: Fullstack Entwickler & Digital Product Thinker. Entdecken Sie seinen Weg, seine Philosophie und seinen Antrieb für klare, zielgerichtete digitale Lösungen.",

  "experience.pageTitle": "Berufserfahrung - Shawn Gordon Becker",
  "experience.pageMetaDescription": "Erkunden Sie Shawn Gordon Beckers Berufserfahrung: Über 5 Jahre Full-Stack-Entwicklung für Startups und Unternehmen, Produktmanagement und technische Führung.",

  "projects.pageTitle": "Projekte - Shawn Gordon Becker",
  "projects.pageMetaDescription": "Ausgewählte digitale und kulturelle Projekte von Shawn Gordon Becker. Einblicke in Fullstack Webentwicklung, Product Thinking und kollaborative Arbeiten.",

  "arts.pageTitle": "Kunst - Shawn Gordon Becker",
  "arts.pageMetaDescription": "Einblicke in die kreativen Arbeiten von Shawn Gordon Becker – Erkundungen in Fotografie, Sound und Skizzen, die eine einzigartige Perspektive auf die Welt zeigen.",

  "contact.pageTitle": "Kontakt - Shawn Gordon Becker",
  "contact.pageMetaDescription": "Nehmen Sie Kontakt mit Shawn Gordon Becker auf. Für Projektanfragen, Ideenaustausch oder eine mögliche Zusammenarbeit im Bereich Webentwicklung und Digitalstrategie."
}
