{
  "langCode": "en",
  "site.title": "Shawn Gordon Becker",
  "nav.about": "About me",
  "nav.services": "Services",
  "nav.projects": "Projects",
  "nav.arts": "Arts",
  "nav.contact": "Contact",

  "home.header.title": "Welcome to my corner of the internet",
  "home.header.subtitle": "A digital space that reflects a human one.",
  "home.intro.p1": "This site is more than a portfolio. It’s a living archive of what I’ve built, explored, and cared about over time – both professionally and personally. You’ll find web projects, creative works, collaborations, and quiet reflections.",
  "home.intro.p2": "I believe the digital world should be more than just fast and efficient – it should feel meaningful, intentional, and human. That’s the thread running through everything I do: from writing clean, thoughtful code to designing interfaces that feel calm, to building communities and creative spaces grounded in trust.",
  "home.intro.p3": "Whether you're here as a potential collaborator, a curious visitor, or someone who shares similar values – I’m glad you’ve found your way here. Take your time. Wander. Discover. Reach out.",

  "about.hero.title": "About Me",
  "about.hero.subtitle": "Not just what I do – but why I do it.",
  "about.intro.greeting": "Hi, I’m Shawn.",
  "about.intro.p1": "I’m a full-stack developer, product thinker, and interdisciplinary creative. My path has never been strictly linear – it’s been shaped by curiosity, collaboration, and a strong inner compass.",
  "about.intro.p2": "What unites my work is a desire to build with care: to create things that are useful, beautiful, and built on solid ground. I’ve worked in startups, non-profits, cultural initiatives, and my own independent projects. I’ve led teams, built products from scratch, coded into the night, and facilitated conversations that matter.",
  "about.intro.p3": "But beyond roles and skills, I’m interested in the spaces in between – between technology and ethics, between design and feeling, between productivity and presence.",
  "about.keyThreads.title": "Some key threads of who I am:",
  "about.keyThreads.item1.title": "International & interdisciplinary background:",
  "about.keyThreads.item1.text": "I studied product management, marketing & computer science – across Ireland, Berlin, and beyond.",
  "about.keyThreads.item2.title": "Community & connection:",
  "about.keyThreads.item2.text": "I’ve co-founded communities, run festivals, and designed experiences rooted in connection.",
  "about.keyThreads.item3.title": "Values-driven approach:",
  "about.keyThreads.item3.text": "I care about sustainability, neurodiversity, and creating systems that respect complexity.",
  "about.keyThreads.item4.title": "Philosophy:",
  "about.keyThreads.item4.text": "I believe in small, good things done well – with clarity, heart, and purpose.",
  "about.cta.p1": "This site is one way of weaving all those parts together.",
  "about.cta.p2": "I hope it gives you a sense of who I am – and the kinds of things I’d love to build with others.",
  "about.cta.connectLink": "Let’s connect"
}
