{
  "langCode": "en",
  "site.title": "Shawn Gordon Becker",
  "nav.about": "About me",
  "nav.services": "Services",
  "nav.projects": "Projects",
  "nav.arts": "Arts",
  "nav.contact": "Contact",

  "home.header.title": "Welcome to my corner of the internet",
  "home.header.subtitle": "A digital space that reflects a human one.",
  "home.intro.p1": "This site is more than a portfolio. It’s a living archive of what I’ve built, explored, and cared about over time – both professionally and personally. You’ll find web projects, creative works, collaborations, and quiet reflections.",
  "home.intro.p2": "I believe the digital world should be more than just fast and efficient – it should feel meaningful, intentional, and human. That’s the thread running through everything I do: from writing clean, thoughtful code to designing interfaces that feel calm, to building communities and creative spaces grounded in trust.",
  "home.intro.p3": "Whether you're here as a potential collaborator, a curious visitor, or someone who shares similar values – I’m glad you’ve found your way here. Take your time. Wander. Discover. Reach out.",

  "about.hero.title": "About Me",
  "about.hero.subtitle": "Not just what I do – but why I do it.",
  "about.intro.greeting": "Hi, I’m Shawn.",
  "about.intro.p1": "I’m a full-stack developer, product thinker, and interdisciplinary creative. My path has never been strictly linear – it’s been shaped by curiosity, collaboration, and a strong inner compass.",
  "about.intro.p2": "What unites my work is a desire to build with care: to create things that are useful, beautiful, and built on solid ground. I’ve worked in startups, non-profits, cultural initiatives, and my own independent projects. I’ve led teams, built products from scratch, coded into the night, and facilitated conversations that matter.",
  "about.intro.p3": "But beyond roles and skills, I’m interested in the spaces in between – between technology and ethics, between design and feeling, between productivity and presence.",
  "about.keyThreads.title": "Some key threads of who I am:",
  "about.keyThreads.item1.title": "International & interdisciplinary background:",
  "about.keyThreads.item1.text": "I studied product management, marketing & computer science – across Ireland, Berlin, and beyond.",
  "about.keyThreads.item2.title": "Community & connection:",
  "about.keyThreads.item2.text": "I’ve co-founded communities, run festivals, and designed experiences rooted in connection.",
  "about.keyThreads.item3.title": "Values-driven approach:",
  "about.keyThreads.item3.text": "I care about sustainability, neurodiversity, and creating systems that respect complexity.",
  "about.keyThreads.item4.title": "Philosophy:",
  "about.keyThreads.item4.text": "I believe in small, good things done well – with clarity, heart, and purpose.",
  "about.cta.p1": "This site is one way of weaving all those parts together.",
  "about.cta.p2": "I hope it gives you a sense of who I am – and the kinds of things I’d love to build with others.",
  "about.cta.connectLink": "Let’s connect",

  "arts.title": "Arts",
  "arts.subtitle": "Exploration without outcome – just presence, practice, and play.",
  "arts.intro.p1": "Before I wrote code, I made music. Before I designed interfaces, I followed light through a lens. Art, for me, is not a separate category – it’s another way of listening to the world.",
  "arts.intro.p2": "This section is a window into the creative side of my life:",
  "arts.photography.title": "Photography:",
  "arts.photography.text": "fragments of light, architecture, mood, and movement",
  "arts.sound.title": "Sound & Music:",
  "arts.sound.text": "analog and digital explorations, ambient compositions, sonic journaling",
  "arts.sketches.title": "Sketches & Studies:",
  "arts.sketches.text": "visual experiments, layout explorations, captured atmospheres",
  "arts.outro.p1": "I don’t publish everything I make – but I share what feels honest. These works aren’t always finished, but they are always true.",
  "arts.outro.p2": "Creativity, for me, is not about showcasing talent. It’s about returning to presence. Paying attention. Letting intuition guide the way.",
  "arts.gallery.imageAlt": "Art Image",
  "arts.gallery.viewImageText": "View Image",

  "projects.title": "Projects",
  "projects.subtitle": "Work with roots, stories, and evolution.",
  "projects.intro.p1": "My projects reflect not just skills, but relationships. They grow from conversations, shared values, and the desire to make something that matters. Some are commercial; others are experimental. Some live in the browser; others take place in communities, spaces, or sound.",
  "projects.whatYoullFind.title": "What you'll find here:",
  "projects.whatYoullFind.item1": "Web applications and tools I’ve built or contributed to",
  "projects.whatYoullFind.item2": "Artistic and collaborative experiments in code, sound, or image",
  "projects.whatYoullFind.item3": "Community-driven projects, including events and platforms",
  "projects.whatYoullFind.item4": "Ventures that integrate ethics, technology, and aesthetics",
  "projects.outro.p1": "I’ll also share some “invisible” projects – the ones that didn’t ship, but taught me something important. Because process matters, too.",
  "projects.outro.p2": "Each project includes a backstory – what worked, what changed, what I’d do differently now.",

  "services.title": "Services",
  "services.subtitle": "Crafting thoughtful digital solutions — from idea to impact.",
  "services.intro.p1": "I support purpose-driven teams, creatives, and founders with a mix of hands-on development, strategic thinking, and human-centered design. Whether you need a digital product built from scratch or guidance to refine your idea — I’m here to help.",
  "services.howICanSupport.title": "How I can support you",
  "services.offering1.title": "Fullstack Development",
  "services.offering1.text": "Custom web apps, responsive frontends, performant APIs. Technologies I use include React, Node.js, Swift, and more.",
  "services.offering2.title": "Product Strategy",
  "services.offering2.text": "Clarify your vision, prioritize features, and align user needs with business goals — from MVPs to mature platforms.",
  "services.offering3.title": "UX/UI & Prototyping",
  "services.offering3.text": "Simple, honest design that speaks clearly. I help translate complexity into intuitive flows and meaningful interactions.",
  "services.offering4.title": "Technical Consulting",
  "services.offering4.text": "From architecture choices to ethical tech decisions — I provide insight with a systems-thinking mindset.",
  "services.offering5.title": "Creative Collaboration",
  "services.offering5.text": "I love working with musicians, artists, and cultural initiatives — helping translate ideas into digital presence.",
  "services.cta.p1": "Curious how we could work together?",
  "services.cta.link": "Let’s start a conversation",

  "contact.title": "Contact",
  "contact.subtitle": "Reach out – with an idea, a question, or just curiosity.",
  "contact.intro.p1": "I’m always open to conversation – whether you're looking to collaborate, need support for a digital project, or just feel drawn to something you’ve seen here.",
  "contact.intro.p2": "You don’t need a polished pitch. A simple message is enough. I value real human connection, and I do my best to respond personally to every inquiry.",
  "contact.form.firstname.label": "First Name:",
  "contact.form.lastname.label": "Last Name:",
  "contact.form.email.label": "E-Mail:",
  "contact.form.phone.label": "Phone (optional):",
  "contact.form.service.label": "Service (optional):",
  "contact.form.service.option.select": "Please select...",
  "contact.form.service.option.development": "Development",
  "contact.form.service.option.consulting": "Consulting",
  "contact.form.service.option.productManagement": "Product Management",
  "contact.form.service.option.other": "Other",
  "contact.form.message.label": "Your Message:",
  "contact.form.submitButton": "Send Message",
  "contact.form.loadingIndicator": "Sending...",
  "contact.reachOutIf.title": "You might reach out if:",
  "contact.reachOutIf.item1": "You want to collaborate on a web or creative project",
  "contact.reachOutIf.item2": "You’re building something thoughtful and need a developer or strategist",
  "contact.reachOutIf.item3": "You’re exploring digital ethics or sustainable tech practices",
  "contact.reachOutIf.item4": "You just want to share something – a thought, a link, an idea",
  "contact.outro.p1": "Let’s see where the conversation leads.",
  "contact.error.internal": "An internal error occurred. Please try again later.",
  "contact.error.requiredFields": "Please fill out all required fields (First Name, Last Name, Email, and Message).",
  "contact.error.configIssue": "Your message could not be sent due to a server configuration issue. Please use the email address in the footer.",
  "contact.error.sendFail": "Your message could not be sent. Please try again later or use the email address in the footer.",
  "contact.success.messageSent": "Your message was sent successfully! I will get back to you as soon as possible.",
  "contact.methodNotAllowed": "Method not allowed",
  "arts.error.loadImages": "Could not load images for the arts section."
}
