{
  "langCode": "en",
  "site.title": "Shawn Gordon Becker",
  "nav.about": "About me",
  "nav.experience": "Experience",
  "nav.projects": "Projects",
  "nav.arts": "Arts",
  "nav.contact": "Contact",

  "common.downloadCV": "Download CV (PDF)",
  "common.githubProfile": "GitHub Profile",
  "common.linkedinProfile": "LinkedIn Profile",

  "home.hero.nameVisual": "Shawn Gordon Becker",
  "home.hero.taglineVisual": "MEANING",
  "home.hero.taglineVisual2": "FORM",
  "home.hero.taglineVisual3": "CODE",
  "home.hero.subIntroText": "Full-stack developer with product thinking. Building scalable web applications that balance technical excellence with user needs.",
  "home.intro.p1": "This is more than a portfolio. It's a reflection of where I've been and where I'm going.",
  "home.intro.p2": "Discover selected works, thoughts, and experiments in art and technology.",
  "home.cta.projects": "Explore Projects",
  "home.cta.experience": "View Experience",
  "home.cta.about": "Learn More About Me",
  "home.cta.downloadCV": "Download CV (PDF)",

  "about.title": "About me",
  "about.pageSubtitle": "A developer who cares about clarity and depth.",
  "about.greeting.title": "Hi, I'm Shawn.",
  "about.greeting.p1": "I'm a fullstack web developer and product thinker. I combine technical precision with design intuition, analytical thinking with empathy. I build digital experiences that work with integrity: clear, purposeful, grounded.",
  "about.greeting.p2": "I focus on simple, sustainable, human-centred solutions. I value honesty over noise, truth over convenience.",
  "about.greeting.p3": "I work with quiet consistency. I look for patterns, recognise systems, and try to make things that genuinely improve something.",

  "about.path.title": "My Path",
  "about.path.p1": "I didn't take a straight path. It started with music and code, film sets and curiosity. Studies in marketing and informatics laid a foundation, but my time in product management (CODE University) connected the dots: structure, empathy, purpose.",
  "about.path.p2": "Over the years, I've worked in different roles: as a developer, product thinker, and collaborator in both digital and cultural spaces. I worked with startups like YPTOKEY and Data4Life, co-founded U/skillity (a platform for shared knowledge) and Kultstätte Keller, a space for art, sound, and community. Along the way, I also supported various film productions, often in assistant roles behind the scenes. These experiences shaped how I understand collaboration, pace, and presence.",

  "about.drivesMe.title": "What Drives Me",
  "about.drivesMe.item1.title": "Clarity & Coherence",
  "about.drivesMe.item1.text": "I design systems and interactions that are calm, understandable, and logical. I notice friction early and look for clarity in response.",
  "about.drivesMe.item2.title": "Human & Value Orientation",
  "about.drivesMe.item2.text": "Technology should serve people, not distract them. I build with respect for time, attention, and trust.",
  "about.drivesMe.item3.title": "Learning & Doing",
  "about.drivesMe.item3.text": "Curiosity drives me. I learn through making and question what we take for granted.",
  "about.drivesMe.item4.title": "Aesthetics & Craftsmanship",
  "about.drivesMe.item4.text": "Form matters as much as function. Thoughtful details and subtle decisions make a difference. Beauty is a sign of care.",

  "about.skillset.title": "What I Work With",
  "about.skillset.devFullstack.title": "Fullstack Web Development",
  "about.skillset.devFullstack.skills": "JavaScript/TypeScript (React, Node.js), Go, HTML5, CSS3, API Development, Databases (MySQL, MongoDB), CMS (WordPress, Headless CMS)",
  "about.skillset.productStrategy.title": "Product Management & Strategy",
  "about.skillset.productStrategy.skills": "Product Strategy, Agile Methodologies (Scrum, Kanban), User Research & Testing (conceptual), UX Conception & User Journey Mapping, Requirements Management, Feature Prioritisation, MVP Planning, Technical Project Management, Team Facilitation",
  "about.skillset.ethicalConsulting.title": "Ethical & Sustainable Tech",
  "about.skillset.ethicalConsulting.skills": "Conscious technology choices, Privacy-by-Design, Accessibility (WCAG), Green IT approaches, Maintenance Strategies",

  "about.outsideScreen.title": "Beyond the Screen",
  "about.outsideScreen.p1": "Outside of work, I explore music (creating and listening), ferment water kefir, ride long distances by bike, or spend time in nature. More recently, I've started learning photography, slowly and intuitively.",
  "about.outsideScreen.p2": "I'm based in Berlin and open to meaningful remote collaborations worldwide.",

  "about.lookingFor.title": "What I'm Looking For",
  "about.lookingFor.p1": "I'm looking for work with product-driven companies where technical excellence meets meaningful impact. I work best in environments that value:",
  "about.lookingFor.item1": "Clean architecture and maintainable codebases",
  "about.lookingFor.item2": "Cross-functional collaboration between engineering, product, and design",
  "about.lookingFor.item3": "Continuous learning and knowledge sharing",
  "about.lookingFor.item4": "Building products that genuinely improve people's lives",
  "about.lookingFor.p2": "Ideal team size: 10-50 people. Ideal role: Full-Stack Developer or Backend-focused position with room to contribute to product thinking.",
  "about.lookingFor.p3": "Location: Berlin-based with openness to hybrid/remote setups.",
  "about.lookingFor.availability": "Availability: Open to discuss timing",
  "about.lookingFor.ctaDownload": "Download CV (PDF)",

  "about.connect.title": "Let's Get in Touch",
  "about.connect.p1": "If any of this resonates – whether you have a project in mind, want to exchange thoughts, or feel there’s a way to collaborate – I’d love to hear from you:",
  "about.connect.ctaText": "Reach Out via Contact Page",
  "about.connect.githubLinkText": "My GitHub Profile",

  "arts.title": "Arts",
  "arts.subtitle": "Beyond Code: Creative Work & Photography. Exploration without outcome, just presence, practice, and play.",
  "arts.intro.title": "Creative Background",
  "arts.intro.p1": "Before I wrote code, I made music. Before I designed interfaces, I followed light through a lens. Art isn't a separate category. It's another way of listening to the world.",
  "arts.intro.p2": "This section is a window into the creative side of my life:",
  "arts.photography.title": "Photography",
  "arts.photography.text": "Fragments of light, architecture, mood, and movement",
  "arts.sound.title": "Sound & Music",
  "arts.sound.text": "Analogue and digital explorations, ambient compositions, sonic journalling",
  "arts.sketches.title": "Sketches & Studies",
  "arts.sketches.text": "Visual experiments, layout explorations, captured atmospheres",
  "arts.outro.p1": "I don't publish everything I make, but I share what feels honest. These works aren't always finished, but they're always true.",
  "arts.outro.p2": "Creativity isn't about showing off talent. It's about being present, paying attention, letting intuition guide the way.",
  "arts.gallery.imageAlt": "Art Image",
  "arts.gallery.viewImageText": "View Image",

  "projects.title": "My Projects",
  "projects.pageSubtitle": "Selected works, playgrounds and collaborations",
  "projects.introduction.title": "Introduction",
  "projects.introduction.p1": "This page shows a selection of digital and cultural projects I've been involved in over the years, from personal portfolio websites to collaborative festival spaces and film work.",
  "projects.introduction.p2": "I try to keep my digital work lean, accessible, and meaningful. This website is both a sandbox and a snapshot of my evolving craft.",
  "projects.currentProject.title": "Current Project: Rebuilding this Website",
  "projects.currentProject.description": "This portfolio is a work-in-progress, built to deepen my understanding of server-side rendering with Go and templating. It's a playground for experimentation and a clean, fast, multilingual website.",
  "projects.currentProject.motivation.label": "Motivation",
  "projects.currentProject.motivation.text": "Learn Go templating, rebuild my online presence with full control and minimal tech stack",
  "projects.currentProject.stack.label": "Tech stack",
  "projects.currentProject.stack.item1": "Go (Golang) + templ SSR templating",
  "projects.currentProject.stack.item2": "Hosted on Render",
  "projects.currentProject.stack.item3": "Email service integration with Resend",
  "projects.currentProject.stack.item4": "Language fallback and routing (i18n)",
  "projects.currentProject.stack.item5": "No framework – pure HTML, CSS and logic",
  "projects.currentProject.linkGithubText": "GitHub Repo",

  "projects.websitesBuilt.title": "Websites I’ve Built",
  "projects.websitesBuilt.jessebecker.name": "jessebecker.de",
  "projects.websitesBuilt.jessebecker.description": "Minimal artist portfolio in pure HTML, CSS & JavaScript. Built for speed, clarity and long-term maintainability.",
  "projects.websitesBuilt.arinashanzev.name": "arinashanzev.com (WIP)",
  "projects.websitesBuilt.arinashanzev.description": "A WordPress portfolio for a practitioner in energy work and therapy, featuring custom theming and a thoughtful layout to convey the essence of her practice.",
  "projects.websitesBuilt.berndwolf.name": "berndwolf.net (freelance support)",
  "projects.websitesBuilt.berndwolf.description": "Provided tailored WordPress customizations and functional extensions for the artist portfolio of Bernd Wolf, focusing on seamless integration and preserving theme integrity.",
  "projects.websitesBuilt.evolveFestivalWebsite.name": "evolve-festival.com",
  "projects.websitesBuilt.evolveFestivalWebsite.description": "Reimagined the festival's former Wix-based website (note: this version is no longer live) to enhance usability and clarity, creating a clear information hierarchy and integrating an embedded ticket system.",
  "projects.websitesBuilt.oldPortfolio.name": "Old portfolio website (2022)",
  "projects.websitesBuilt.oldPortfolio.description": "A SPA website written in React with TailwindCSS. Served as my initial web presence.",
  "projects.websitesBuilt.uskillity.name": "U/skillity (prototype)",
  "projects.websitesBuilt.uskillity.description": "Educational web platform concept – co-founder and lead developer of MVP with user management and content publishing.",
  "projects.websitesBuilt.uskillity.linkInstagramText": "Uskillity on Instagram",
  "projects.websitesBuilt.uskillity.linkFrontendRepoText": "Frontend Repo (GitHub)",
  "projects.websitesBuilt.uskillity.linkBackendRepoText": "Backend Repo (GitHub)",

  "projects.cultural.title": "Cultural & Creative Projects",
  "projects.cultural.kultschaette.name": "Kultstätte Keller (2011–2016)",
  "projects.cultural.kultschaette.p1": "Co-founded Kultstätte Keller, a vibrant hybrid cultural space in Berlin, housing a yoga studio, recording facilities, a club, and a workshop venue.",
  "projects.cultural.kultschaette.p2": "Led creative direction, event management, technical infrastructure, and communications for this community hub.",
  "projects.cultural.evolveFestivalSupport.name": "Evolve Festival (2024)",
  "projects.cultural.evolveFestivalSupport.p1": "Organisational support and website consulting, involved in communication, structure and UX design.",
  "projects.cultural.vegetarischDeluxe.name": "Vegetarisch Deluxe - Band",
  "projects.cultural.vegetarischDeluxe.p1": "Bass player and co-creator of this DIY punk band. Handled website, booking and visual content.",

  "projects.film.title": "Film Projects",
  "projects.film.description": "Film production crew member in various short and feature-length projects, mostly in lighting and camera departments.",
  "projects.film.linkCrewUnitedText": "Shawn Gordon Becker on Crew United",

  "experience.title": "Experience",
  "experience.pageSubtitle": "From Sound to Systems — A Non-Linear Path to Software Development",

  "experience.pageIntro": "I didn't follow a straight path to software development. It moved through sound engineering, nightclub management, film sets, and peer learning platforms before arriving at code. Each phase taught me something about building systems that work, whether mixing audio, organising cultural spaces, or architecting backends. What follows isn't a resume. It's the story of how I learned to translate between disciplines and find coherence in complexity.",

  "experience.chapter1.title": "Sound, Space, and Systems",
  "experience.chapter1.subtitle": "2006 - 2016",
  "experience.chapter1.p1": "I didn't learn to build systems in a computer science classroom. It started at 21, standing behind a mixing console at SAE Institute in Berlin, learning to shape acoustic space. I'd played bass in a punk band through my teens (music was always present) but I wasn't interested in virtuosity. What drew me was the engineering: how frequencies interact, how a mix creates dimension, how you can build an atmosphere from discrete elements.",
  "experience.chapter1.p2": "Audio production taught me a way of thinking I didn't have words for yet. You're constantly balancing elements, finding clarity in complexity, making technical decisions that serve a feeling. After SAE, I spent several years exploring, working various jobs, including assistant roles on film sets through my father's connections as a camera operator. Those film productions taught me about collaboration under pressure, about craft, and about being present when the work demands it.",
  "experience.chapter1.p3": "In 2011, through friends in Berlin's cultural scene, I got involved with an empty building in Neukölln. The idea was to create space for art and community events. I started building recording studios in the basement. What we created instead was Kultstätte Keller, which grew from occasional parties into a nightclub running entertainment six nights a week. I never finished those studios. Instead, I became co-owner and operator, managing sound systems, technical infrastructure, and logistics for a space that had found its own momentum.",
  "experience.chapter1.p4": "Running Kultstätte taught me about systems at scale: organisational, technical, human. But it also showed me the limits of a certain kind of success. By 2015, after years in nightlife, I started to notice the toll: how people age in that environment, the consumption that comes with it, the feeling that something essential was missing. I wanted to build things that lasted differently.",
  "experience.chapter1.p5": "Around this time, I did a three-month internship at Peppermint Park Studios in Hannover, working under Hans Martin Buff, who would go on to win a Grammy. In those three months, I learned more about audio engineering than in my entire formal education, not because the curriculum was better, but because I was learning directly from someone deeply passionate about their craft. That experience planted a seed: passionate people teach their craft effortlessly, and learning works best when it's peer-to-peer and practice-based.",
  "experience.chapter1.p6": "This insight became U/skillity, a platform idea I co-founded with my girlfriend: a peer-to-peer marketplace for microskills, where anyone could teach what they knew and learn what they needed. Think Airbnb, but for knowledge. The problem was, I had no real understanding of business or technology beyond what I'd picked up intuitively.",
  "experience.chapter1.p7": "So in 2016, I completed an IHK certification in Business Administration and discovered something unexpected: I enjoyed structured learning. I'd left school early, underwhelmed and bored, but now at 30, with years of practical experience behind me, formal education felt different. I wanted more. But without an Abitur, traditional university paths were closed.",
  "experience.chapter1.p8": "That's when I found the HEAR programme at the National University of Ireland Maynooth, a route designed for mature students entering higher education later in life. I took the entry exams, got accepted, and moved to Ireland.",

  "experience.chapter2.title": "The Formalisation Years",
  "experience.chapter2.subtitle": "2016 - 2022",
  "experience.chapter2.p1": "Ireland was hard. I studied business and marketing full-time, but found myself increasingly drawn to a computer science module I'd added, particularly Java programming, which clicked in a way the business courses didn't. The work was intense: five days of lectures, then working evenings and weekends at an Apple retail job to finance it all. But I was learning, and U/skillity continued remotely as my girlfriend and I iterated on prototypes.",
  "experience.chapter2.p2": "After a year and a half, I discovered something interesting: because I'd been accepted to one EU university, I could transfer anywhere in Europe. I'd heard about CODE University in Berlin, a new kind of institution focused on interdisciplinary product development and applied learning. I applied, got in, and moved back home in 2018 to study Product Management.",
  "experience.chapter2.p3": "CODE was where things started connecting. The programme emphasised synthesis: how technology, design, business, and human needs intersect. Structure, empathy, and purpose weren't separate concerns. They shaped each other. But I also needed to work. That's when I found YPTOKEY, a startup building blockchain-based IoT access systems.",
  "experience.chapter2.p4": "I joined as a Product Owner and Frontend Developer, but quickly found myself in an unexpected role: translator. The CEO and CTO spoke different languages (one focused on business strategy, the other on technical architecture) and I could understand both. I started building React proof-of-concepts for potential customers, explaining blockchain to sales teams, and bridging the gap between vision and implementation. It was the first time I'd built something with code that mattered to a business outcome, and I was largely self-taught, drawing on the Java foundations from Ireland and resources at CODE.",
  "experience.chapter2.p5": "When COVID hit in 2020, YPTOKEY faced financial pressure and I lost the role. I used the time to reconsider what I actually wanted to do and realised I missed programming more than product management. In early 2021, I took a Technical Project Manager role at Data4Life, a digital health company. The team was kind, but the work felt misaligned: trying to create a startup culture inside a corporate structure, working with people who fundamentally didn't want that. It clarified something important: I wanted to build, not just coordinate.",
  "experience.chapter2.p6": "By mid-2021, I'd moved to Freiheit.software as a Frontend Developer. I loved it immediately: remote work, travelling while coding, working on real enterprise applications with React, Node.js, and TypeScript. Then something unexpected happened: the team needed full-stack support, and I got pulled into backend work. I discovered I enjoyed it even more. There was something deeply satisfying about designing systems end-to-end, thinking about architecture, data flow, and how pieces fit together logically.",
  "experience.chapter2.p7": "When Freiheit lost a client in late 2022 and had to let me go, I used one of their former customer contacts to start freelancing. After years of employment, I thought independence might be what I needed.",

  "experience.chapter3.title": "Seeking Depth",
  "experience.chapter3.subtitle": "2023 - Present",
  "experience.chapter3.p1": "Three years into freelance work, I've learned what I don't want as clearly as what I do.",
  "experience.chapter3.p2": "The freedom is real. I set my schedule, choose my tools, work from anywhere. But the work itself has been limiting: mostly small landing pages, WordPress customisations, design tweaks for clients who need a web presence but not a system. I've realised I don't enjoy client acquisition, and I miss the structure of regular income. But more than that, I miss deep logical work.",
  "experience.chapter3.p3": "What I mean by that: building backends, architecting systems, solving complex problems that require sustained thought and careful design. The kind of work where you're not customising a template, but creating something with internal logic and coherence. I miss working with a team, people to learn from, to review code with, to discuss trade-offs and approaches.",
  "experience.chapter3.p4": "U/skillity still resurfaces in my mind occasionally. Now that I have the technical skills, I sometimes think about rebuilding it properly. The idea (that passionate people teach best, and learning should be peer-driven) never really left. It's part of why I care about mentorship and knowledge sharing in teams.",
  "experience.chapter3.p5": "In 2025, after months of job applications without success, I enrolled in the Advanced Web Development Programme at Neue Fische, an intensive bootcamp focused on modern TypeScript, backend architecture, testing strategies, and deployment workflows. It's been a way to sharpen my skills, update my knowledge, and stay current while searching.",
  "experience.chapter3.p6": "What I'm looking for is clearer now than it's ever been. I want to work on a team (ideally 10-50 people) where I can contribute as a Full-Stack or Backend-focused developer. I want to work on products that matter, with clean architecture and cross-functional collaboration between engineering, design, and product. I want to go deep into systems, databases, APIs, and infrastructure to build things that are coherent, maintainable, and grounded in real user needs.",
  "experience.chapter3.p7": "Looking back, the path makes sense. Audio engineering taught me to shape systems from components. Kultstätte taught me to manage complexity and adapt to what emerges. Film work taught me collaboration and craft. U/skillity taught me that I care about how people learn. YPTOKEY taught me I'm a translator between disciplines. Freiheit taught me I love backend systems thinking.",
  "experience.chapter3.p8": "I'm not starting a career at 40. I'm bringing twenty years of learning how to build things that work (whether sonic, cultural, or digital) and focusing that synthesis on software systems. I know what drives me now: clarity, depth, and work that improves something real.",
  "experience.chapter3.p9": "If you're building products with care and looking for someone who thinks across disciplines, understands systems, and wants to go deep, let's talk.",

  "experience.timeline.title": "Timeline",
  "experience.timeline.year2006": "2006",
  "experience.timeline.label2006": "Audio Engineering (SAE)",
  "experience.timeline.year2011": "2011",
  "experience.timeline.label2011": "Kultstätte Keller (Co-founder)",
  "experience.timeline.year2016": "2016",
  "experience.timeline.label2016": "U/skillity (Co-founder) + IHK",
  "experience.timeline.year2017": "2017",
  "experience.timeline.label2017": "Ireland (HEAR Mature Students)",
  "experience.timeline.year2018": "2018",
  "experience.timeline.label2018": "CODE University + YPTOKEY",
  "experience.timeline.year2021": "2021",
  "experience.timeline.label2021": "Data4Life → Freiheit",
  "experience.timeline.year2023": "2023",
  "experience.timeline.label2023": "Freelance Practice",
  "experience.timeline.year2025": "2025",
  "experience.timeline.label2025": "Neue Fische + Job Search",
  "experience.timeline.labelPresent": "Present",

  "experience.cta.downloadCV": "Download Complete CV (PDF)",
  "experience.cta.viewProjects": "Explore Project Portfolio →",

  "contact.title": "Contact",
  "contact.subtitle": "Reach out with an idea, a question, or just curiosity.",
  "contact.details.title": "Contact Information",
  "contact.intro.title": "Let's Connect",
  "contact.intro.p1": "I'm always open to conversation, whether you're looking to collaborate, need support for a digital project, or just feel drawn to something you've seen here.",
  "contact.intro.p2": "You don't need a polished pitch. A simple message is enough. I value real human connection, and I do my best to respond personally to every enquiry.",
  "contact.intro.availability": "Open to permanent positions (sozialversicherungspflichtig) in Berlin and interesting remote opportunities.",
  "contact.form.firstname.label": "First Name:",
  "contact.form.lastname.label": "Last Name:",
  "contact.form.email.label": "E-Mail:",
  "contact.form.phone.label": "Phone (optional):",
  "contact.form.service.label": "Service (optional):",
  "contact.form.service.option.select": "Please select...",
  "contact.form.service.option.development": "Development",
  "contact.form.service.option.consulting": "Consulting",
  "contact.form.service.option.productManagement": "Product Management",
  "contact.form.service.option.other": "Other",
  "contact.form.message.label": "Your Message:",
  "contact.form.submitButton": "Send Message",
  "contact.form.loadingIndicator": "Sending...",
  "contact.reachOutIf.title": "You might reach out if:",
  "contact.reachOutIf.item1": "You're hiring for a full-stack or backend developer role in Berlin",
  "contact.reachOutIf.item2": "You want to collaborate on a web or creative project",
  "contact.reachOutIf.item3": "You're building something thoughtful and need a developer or strategist",
  "contact.reachOutIf.item4": "You're exploring digital ethics or sustainable tech practices",
  "contact.reachOutIf.item5": "You just want to share something: a thought, a link, an idea",
  "contact.outro.p1": "Let’s see where the conversation leads.",
  "contact.error.internal": "An internal error occurred. Please try again later.",
  "contact.error.requiredFields": "Please fill out all required fields (First Name, Last Name, Email, and Message).",
  "contact.error.configIssue": "Your message could not be sent due to a server configuration issue. Please use the email address in the footer.",
  "contact.error.sendFail": "Your message could not be sent. Please try again later or use the email address in the footer.",
  "contact.success.messageSent": "Your message was sent successfully! I will get back to you as soon as possible.",
  "contact.methodNotAllowed": "Method not allowed",
  "arts.error.loadImages": "Could not load images for the arts section.",

  "home.pageTitle": "Shawn Becker – Fullstack Developer & Product Thinker",
  "home.pageMetaDescription": "Fullstack Developer blending code, design & product thinking. TypeScript, Go, React. Building meaningful web solutions in Berlin.",

  "about.pageTitle": "Shawn Becker – About Me, Developer & Thinker",
  "about.pageMetaDescription": "Fullstack developer with 7+ years experience. Bridging technical precision with product thinking. TypeScript, React, Go. Based in Berlin.",

  "experience.pageTitle": "Shawn Becker – 7+ Years Fullstack Development",
  "experience.pageMetaDescription": "7+ years fullstack development: React, TypeScript, Go. Product management & technical leadership for startups. Based in Berlin.",

  "projects.pageTitle": "Shawn Becker – Web Projects & Creative Work",
  "projects.pageMetaDescription": "Portfolio of web development projects: Go SSR, React SPAs, WordPress sites. Cultural projects & collaborations in Berlin.",

  "arts.pageTitle": "Shawn Becker – Photography & Creative Arts",
  "arts.pageMetaDescription": "Creative explorations beyond code: photography, sound design, visual experiments. A developer's artistic practice in Berlin.",

  "contact.pageTitle": "Contact Shawn Becker – Developer in Berlin",
  "contact.pageMetaDescription": "Hire a fullstack developer in Berlin. Available for permanent positions & collaborations. TypeScript, React, Go expertise."
}
